res = ",".join(
    [
        e
        for e in '''Петровский колледж
Технологический колледж № 34
Алтайский архитектурно-строительный колледж
Поволжский государственный колледж
Институт государственного администрирования
ESSEC Business School
Jackson State University
Reed College
University of Pennsylvania
Yale University
"Крымский университет культуры, искусств и туризма"
Марийский государственный университет
Марийский филиал Московской открытой социальной академии
Межрегиональный открытый социальный институт
Поволжский государственный технологический университет
Seoul National University
Paris-Saclay University
University of Texas at Austin
"University of California, San Diego"
Karolinska Institute
Sorbonne University
University of Copenhagen
"University of California, San Francisco"
University of North Carolina at Chapel Hill
Dartmouth College
Institut Polytechnique de Paris
University of Paris
'King''s College London'
Ludwig Maximilian University of Munich
University of Edinburgh
University of Minnesota - Twin Cities
Washington University in St. Louis
University of British Columbia
Rockefeller University
Rutgers University–New Brunswick
University of Southern California
"University of California, Davis"
Vanderbilt University
Pennsylvania State University
Free University of Berlin
Ohio State University
University of Manchester
Tsinghua University
Peking University
Humboldt University of Berlin
Purdue University
University of Texas Southwestern Medical Center
University of Melbourne
Hebrew University of Jerusalem
University of Zurich
Brown University
Weizmann Institute of Science
University of Colorado Boulder
Алтайский государственный институт культуры
KU Leuven
Алтайский государственный медицинский университет
Алтайский государственный педагогический университет
Алтайский государственный технический университет им. И.И. Ползунова
Алтайский государственный университет
Брянский институт управления и бизнеса 
Брянский филиал Академии права и управления (института)
University of Virginia
Heidelberg University
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Гжельский государственный университет"""
Федеральное государственное бюджетное образовательное учреждение высшего образования «Волгоградский государственный технический университет»
Utrecht University
University of Pittsburgh
University of Chinese Academy of Sciences
"Texas A&M University, College Station"
"University of Maryland, College Park"
Georgia Institute of Technology
University of Oslo
Osaka University
University of Birmingham
Technical University of Munich
University of Alberta
"University of California, Irvine"
University of Rochester
University of Amsterdam
Carnegie Mellon University
University of Florida
Leiden University
Uppsala University
National University of Singapore
National Taiwan University
University of Bristol
University of Göttingen
University of Arizona
Boston University
"University of California, Santa Barbara"
Erasmus University Rotterdam
Keio University
University of Sydney
University of Geneva
University of Basel
University of Leeds
Shanghai Jiao Tong University
University of Groningen
École Polytechnique Fédérale de Lausanne
University of São Paulo
University of Texas MD Anderson Cancer Center
Aarhus University
University of Tübingen
University of Queensland
Zhejiang University
Indiana University Bloomington
University of Utah
Sapienza University of Rome
University of New South Wales
Fudan University
University of Southampton
University of Helsinki
INSEAD
University of Montreal
Ghent University
University of Freiburg
University of Bonn
Emory University
Australian National University
University of Glasgow
Baylor College of Medicine
Monash University
Case Western Reserve University
Nagoya University
University of Barcelona
Tohoku University
Goethe University Frankfurt
Tufts University
University of Nottingham
Nanyang Technological University
University of Liverpool
Grenoble Alpes University
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Волгоградский государственный технический университет""."
Российская академия государственной службы при  Президенте Российской Федерации 
Тольяттинский военный технический институт
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Петербургский государственный университет путей сообщения Императора Александра I"""
Рязанский военный автомобильный институт имени генерала армии В. П. Дубынина
"Федеральное государственное автономное образовательное учреждение высшего образования ""Северный (Арктический) федеральный университет имени М. В. Ломоносова"""
"Образовательное частное учреждение высшего образование ""Московская международная академия"""
Таганрогский государственный радиотехнический университет
Ульяновское высшее военное инженерное училище связи
"Государственное автономное образовательное учреждение высшего образования ""Невинномысский государственный гуманитарно-технический институт"""
Алтайский институт труда и права (филиал) Академии труда и социальных отношений
Алтайский институт финансового управления
Алтайский институт экономики - филиал Санкт-Петербургского университета управления и экономики 
Алтайский филиал Московского государственного института культуры
Алтайский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
Алтайский филиал Российской международной академии туризма
Алтайский экономико-юридический институт
Барнаульский филиал Московской академии предпринимательства при Правительстве Москвы
Барнаульский филиал Современной гуманитарной академии
Барнаульский филиал Финансового университета при Правительстве Российской Федерации 
Барнаульский юридический институт
Институт водных и экологических проблем Сибирского отделения Российской академии наук
Институт национальной безопасности и управления рисками
Рубцовский индустриальный институт (филиал) Алтайского государственного технического университета им. И.И. Ползунова
Рубцовский институт (филиал) Алтайского государственного университета
University of Science and Technology of China
Филиал Столичной финансово-гуманитарной академии в г. Владимире
Ульяновский филиал Современной гуманитарной академии
Волгоградская академия Министерства внутренних дел Российской Федерации
Волгоградская государственная академия физической культуры
Волгоградская консерватория им. П. А. Серебрякова
Волгоградский государственный аграрный университет
Волгоградский государственный институт искусств и культуры
Волгоградский государственный медицинский университет
Волгоградский государственный социально-педагогический университет
Волгоградский государственный технический университет
Волгоградский государственный университет
Волгоградский гуманитарный институт
Волгоградский институт бизнеса
"Каменский технологический институт(филиал) федерального государственного бюджетного образовательного учреждения высшего образования ""Южно-Российский государственный политехнический университет (НПИ) имени М.И. Платова"""
Рубцовский филиал Университета Российской академии образования
Астраханский государственный медицинский университет
Филиал Алтайского государственного университета в г. Белокурихе
Филиал Алтайского государственного университета в г. Бийске
Филиал Алтайского государственного университета в г. Славгороде
Институт современного искусства
Филиал Московского психолого-социального университета в г. Барнауле Алтайского края
Филиал Сибирского государственного университета путей сообщения в г. Новоалтайске 
Амурская государственная медицинская академия
Амурский государственный университет 
Амурский институт железнодорожного транспорта - филиал Дальневосточного государственного университета путей сообщения в г. Свободном
Амурский филиал Морского государственного университета имени адмирала Г.И. Невельского
Благовещенский государственный педагогический университет 
Благовещенский филиал Московской академии предпринимательства при Правительстве Москвы
Благовещенский филиал Современной гуманитарной академии
KTH Royal Institute of Technology
Lund University
VU Amsterdam
University of Bern
Stockholm University
Брянский государственный технический университет
Брянский государственный университет имени академика И.Г. Петровского
"Санкт-Петербургское государственное бюджетное профессиональное образовательное учреждение «Академия управления городской средой, градостроительства и печати»"
Якутский институт экономики – филиал Санкт-Петербургского университета технологий управления и экономики
Уральский технический институт связи и информатики (филиал) федерального государственного бюджетного образовательного учреждения высшего образования «Сибирский государственный университет телекоммуникаций и информатики»
Федеральное государственное бюджетное учреждение науки институт философии российской академии наук
Негосударственное (частное) образовательное учреждение высшего профессионального образования «Московская академия образования Натальи Нестеровой »
Астраханский (г. Астрахань) филиал Международного юридического института
"Санкт-Петербургское государственное бюджетное профессиональное образовательное учреждение «Академия управления городской средой, градостроительства и печати»"
Федеральное Государственное Бюджетное Учреждение «Национальный медицинский исследовательский центр психиатрии и наркологии имени В.П. Сербского» Министерства здравоохранения Российской Федерации
Федеральное государственное научно-исследовательское учреждение «Институт законодательства и сравнительного правоведения при Правительстве Российской Федерации»
Северо-Кавказский институт (филиал) Автономной некоммерческой организации высшего образования Московского гуманитарно-экономического университета
Федеральное государственное бюджетное учреждение науки физико-технический институт им. А.Ф. Иоффе российской академии наук
Чебоксарский кооперативный институт (филиал) московского университета потребительской кооперации
Волжский политехнический институт (филиал) федерального государственного бюджетного образовательного учреждения высшего образования «Волгоградский государственный технический университет»
Государственное образовательное учреждение высшего профессионального образования - Военный институт радиоэлектроники министерства обороны российской федерации
Севастопольское государственное бюджетное образовательное учреждение профессионального образования «Севастопольский медицинский колледж имени Жени Дерюгиной»
Государственное образовательное учреждение высшего профессионального образования - академия государственного и муниципального управления при президенте республики Татарстан
"Некоммерческое партнерство дополнительного образования и дополнительного профессионального образования ""Британская высшая школа дизайна"""
Курганское высшее военно-политическое авиационное училище
Сибайский институт (филиал) Федерального государственного бюджетного образовательного учреждения высшего образования «Уфимский университет науки и технологий»
Федеральное государственное бюджетное образовательное учреждение высшего образования «Казанский национальный исследовательский технологический университет» (ФГБОУ ВО «КНИТУ»)
Частное образовательное учреждение высшего образования «Камский институт гуманитарных и инженерных технологий»
Астраханский государственный архитектурно-строительный университет
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Новочеркасская государственная мелиоративная академия"""
"Научная автономная некоммерческая организация ""Дальневосточный институт международных отношений"""
"Государственное образовательное учреждение высшего профессионального образования ""Ульяновское высшее военно-техническое училище (военный институт)"" министерства обороны российской федерации"
Алтайский государственный аграрный университет
Алтайский государственный гуманитарно-педагогический университет имени В.М. Шукшина 
"Дальневосточное высшее военное командное училище (военный институт) имени Маршала Советского Союза К.К. Рокоссовского (филиал) Военного учебно-научного центра Сухопутных войск ""Общевойсковая академия Вооруженных Сил Российской Федерации"" "
Дальневосточный государственный аграрный университет
Открытый Институт Муниципальных Проблем
Арктический морской институт имени В.И. Воронина - филиал Государственного университета морского и речного флота имени адмирала С.О. Макарова
Архангельский филиал Финансового университета при Правительстве Российской Федерации
Институт управления (г. Архангельск)
Котласский филиал Государственного университета морского и речного флота имени адмирала С.О. Макарова
Северный (Арктический) федеральный университет имени М.В. Ломоносова
Северный государственный медицинский университет
Северный институт предпринимательства
Северодвинский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Филиал Санкт-Петербургского государственного университета культуры и искусств в г. Архангельске
филиал Северного (Арктического) федерального университета имени М.В. Ломоносова в г. Коряжме Архангельской области
Белгородский филиал Современной гуманитарной академии
Филиал Северного (Арктического) федерального университета имени М.В. Ломоносова в г. Северодвинске Архангельской области 
Астраханская государственная консерватория (академия)
Институт индустрии моды
Астраханский государственный технический университет
Астраханский государственный университет
Астраханский филиал Волжского государственного университета водного транспорта
"Астраханский филиал Московского финансово-промышленного университета ""СИНЕРГИЯ"""
Астраханский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
Астраханский филиал Саратовского государственного аграрного университета имени Н.И. Вавилова
Астраханский филиал Современной гуманитарной академии
Астраханский филиал Университета Российской академии образования
Астраханский филиал Южно-Российского гуманитарного института
Институт мировой экономики и финансов
Филиал Международного института экономики и права в городе Астрахани
Филиал Саратовской государственной академии права в г. Астрахани
Белгородский государственный аграрный университет имени В. Я. Горина
Белгородский государственный институт искусств и культуры
Белгородский государственный национальный исследовательский университет
Белгородский государственный технологический университет им. В.Г. Шухова
Белгородский инженерно-экономический институт
"Белгородский университет кооперации, экономики и права"
Белгородский филиал Московского государственного университета путей сообщения 
"Белгородский филиал Московского государственного университета экономики, статистики и информатики (МЭСИ) "
Harvard University
Белгородский юридический институт Министерства внутренних дел Российской Федерации 
Губкинский филиал Белгородского государственного технологического университета им. В.Г. Шухова
Хабаровский филиал Современной гуманитарной академии
Старооскольский технологический институт им. А.А. Угарова (филиал) Национального исследовательского технологического университета «МИСиС» 
Старооскольский филиал Белгородского государственного университета
Челябинский филиал Современной гуманитарной академии
Брянский государственный аграрный университет
Брянский государственный инженерно-технологический университет
"Брянский филиал Московского государственного университета экономики, статистики и информатики (МЭСИ)"
"Брянский филиал Национального государственного Университета физической культуры, спорта и здоровья имени П.Ф. Лесгафта, Санкт-Петербург "
Брянский филиал Российского университета кооперации
Брянский филиал Российского экономического университета имени Г.В. Плеханова
Брянский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
Брянский филиал Современной гуманитарной академии
Брянский филиал Финансового университета при Правительстве Российской Федерации 
Филиал Московского нового юридического института в г. Брянске
Тюменский филиал Современной гуманитарной академии
Владимирский государственный университет имени Александра Григорьевича и Николая Григорьевича Столетовых
Владимирский институт туризма и гостеприимства
Владимирский филиал Московского финансово-юридического университета МФЮА
Владимирский филиал Российского университета кооперации
Владимирский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Владимирский филиал Российской международной академии туризма
Владимирский филиал Современной гуманитарной академии
Владимирский филиал Финансового университета при Правительстве Российской Федерации
Владимирский юридический институт Федеральной службы исполнения наказаний
Ковровская государственная технологическая академия имени В.А. Дегтярева
Ижевский филиал Современной гуманитарной академии
Brandeis University
Муромский институт (филиал) Владимирского государственного университета имени Александра Григорьевича и Николая Григорьевича Столетовых
Покровский филиал Московского педагогического государственного университета
Филиал Московского психолого-социального университета в г. Муроме Владимирской области
University of Iowa
"Волгоградский институт экономики, социологии и права"
Волгоградский кооперативный институт (филиал) Российского университета кооперации
Волгоградский филиал Академии труда и социальных отношений
Волгоградский филиал Международного славянского института
Волгоградский филиал Московского государственного университета путей сообщения
Волгоградский филиал Российского экономического университета имени Г.В. Плеханова
Волгоградский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
Волгоградский филиал Современной гуманитарной академии
Волгоградский филиал Финансового университета при Правительстве Российской Федерации
Волгоградский юридический институт
Волжский (г. Волжский Волгоградской области) филиал Международного юридического института
Волжский гуманитарный институт (филиал) Волгоградского государственного университета
"Волжский институт экономики, педагогики и права "
Чебоксарский филиал Современной гуманитарной академии
Камышинский технологический институт (филиал) Волгоградского государственного технического университета
Камышинский филиал Современной гуманитарной академии
Линевский филиал Сибирской государственной геодезической академии
Себряковский филиал Волгоградского государственного архитектурно-строительного университета
Филиал Волгоградского государственного социально-педагогического университета в г. Михайловке Волгоградской области
Филиал Международного института экономики и права в городе Волгограде
"Филиал Национального исследовательского университета ""МЭИ"" в г. Волжском"
Вологодская государственная молочнохозяйственная академия имени Н.В. Верещагина
Вологодский государственный университет
Вологодский институт бизнеса
Michigan State University
Вологодский институт права и экономики Федеральной службы исполнения наказаний
Вологодский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
Вологодский филиал Современной гуманитарной академии
Филиал Санкт-Петербургского государственного экономического университета в г. Череповце
Massachusetts Institute of Technology
Филиал Столичной финансово-гуманитарной академии в г. Череповце
Череповецкий военный инженерный институт радиоэлектроники
Череповецкий государственный университет
Череповецкий филиал Московской государственной академии водного транспорта
Борисоглебский филиал Воронежского государственного университета
"Борисоглебский филиал Института менеджмента, маркетинга и финансов"
Воронежский государственный институт искусств
Воронежский государственный аграрный университет имени императора Петра I
Воронежская государственная академия спорта
Воронежский государственный лесотехнический университет имени Г.Ф. Морозова
Воронежский государственный педагогический университет
Воронежский государственный технический университет
Воронежский государственный университет
Воронежский государственный университет инженерных технологий
Воронежский государственный медицинский университет им. Н.Н. Бурденко
Воронежский институт высоких технологий
Воронежский институт инновационных систем
"Воронежский институт кооперации (филиал) Белгородского университета кооперации, экономики и права"
Воронежский институт Министерства внутренних дел Российской Федерации
Воронежский институт правительственной связи (филиал) Академии Федеральной службы охраны Российской Федерации
Воронежский институт Федеральной службы исполнения наказаний
Воронежский институт экономики и социального управления
Воронежский филиал Государственного университета морского и речного флота имени адмирала С.О. Макарова 
Воронежский филиал Московского государственного университета путей сообщения
Воронежский филиал Московского гуманитарно-экономического университета
Воронежский филиал Московской открытой социальной академии
Воронежский филиал Российского экономического университета имени Г.В. Плеханова
Воронежский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Воронежский филиал Современной гуманитарной академии
Воронежский экономико-правовой институт
"Институт менеджмента, маркетинга и финансов "
Международный институт компьютерных технологий
Филиал Воронежского государственного технического университета в г. Борисоглебске
"Филиал Московского института экономики, менеджмента и права в г. Воронеже"
Центральный филиал Российской академии правосудия (г. Воронеж)
Биробиджанский филиал Амурского государственного университета
Биробиджанский филиал Дальневосточного государственного аграрного университета
Приамурский государственный университет имени Шолом-Алейхема
Забайкальский аграрный институт - филиал Иркутского государственного аграрного университета имени А.А.Ежевского
Забайкальский государственный университет
Забайкальский институт железнодорожного транспорта - филиал Иркутского государственного университета путей сообщения
Забайкальский институт предпринимательства - филиал Сибирского университета потребительской кооперации
University of Waterloo
Читинская государственная медицинская академия
Читинский институт – филиал Байкальского государственного университета
Читинский филиал Современной гуманитарной академии
Ивановская государственная медицинская академия Министерства здравоохранения и социального развития Российской Федерации
"Институт экономики, финансов и права"
Ивановская государственная сельскохозяйственная академия имени академика Д.К. Беляева
Ивановский (г. Иваново) филиал Международного юридического института
Ивановский государственный политехнический университет 
Ивановский государственный университет
Ивановский государственный химико-технологический университет 
Ивановский государственный энергетический университет имени В.И. Ленина
Иркутский юридический институт (филиал) Университета прокуратуры Российской Федерации
"Ивановский институт Государственной противопожарной службы Министерства Российской Федерации по делам гражданской обороны, чрезвычайным ситуациям и ликвидации последствий стихийных бедствий"
Ивановский филиал Владимирского юридического института Федеральной службы исполнения наказаний
Ивановский филиал Института управления
Ивановский филиал Российского университета кооперации
Ивановский филиал Российского экономического университета имени Г.В. Плеханова
Ивановский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Ивановский филиал Современной гуманитарной академии
"Институт бизнеса, информационных технологий и финансов"
Ангарский государственный технический университет
"Ангарский филиал Сибирской академии права, экономики и управления"
Байкальский государственный университет
Братский государственный университет
Восточно-Сибирский институт Министерства внутренних дел Российской Федерации
Восточно-Сибирский институт экономики и права
University of Lisbon
Восточно-Сибирский филиал Российского государственного университета правосудия
Иркутский государственный аграрный университет имени А.А.Ежевского
Иркутский государственный медицинский университет Министерства здравоохранения Российской Федерации
Иркутский государственный университет
Иркутский государственный университет путей сообщения
Иркутский институт международного туризма
Иркутский национальный исследовательский технический университет
Иркутский филиал Академии труда и социальных отношений
Иркутский филиал Московского государственного технического университета гражданской авиации
Иркутский филиал Российского государственного торгово-экономического университета 
Иркутский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Иркутский филиал Современной гуманитарной академии
Temple University
"Сибирская академия права, экономики и управления "
Филиал Байкальского государственного университета экономики и права в г. Братске
Филиал Иркутского государственного университета в г. Братске
Филиал Иркутского государственного университета путей сообщения в г. Братске
"Филиал Российского государственного университета физической культуры, спорта, молодежи и туризма в г. Иркутске"
Кабардино-Балкарский государственный аграрный университет имени В.М. Кокова 
Кабардино-Балкарский государственный университет им. Х.М. Бербекова
Кабардино-Балкарский институт бизнеса
"Нальчикский институт кооперации (филиал) Белгородского университета кооперации, экономики и права"
Северо-Кавказский государственный институт искусств
Филиал Армавирского лингвистического социального института в г. Нальчике
Балтийская государственная академия рыбопромыслового флота
Калужский институт туристского бизнеса - филиал Российской международной академии туризма
"Балтийский военно-морской институт имени Адмирала Ф.Ф. Ушакова (филиал) Военного учебно-научного центра Военно-Морского Флота ""Военно-морская академия имени Адмирала Флота Советского Союза Н.Г. Кузнецова"""
Балтийский институт экономики и финансов
Балтийский федеральный университет имени Иммануила Канта 
Калининградский государственный технический университет
Калининградский институт туризма - филиал Российской международной академии туризма
Калининградский институт управления
Калининградский институт экономики - филиал Санкт-Петербургского университета управления и экономики
Калининградский пограничный институт Федеральной службы безопасности Российской Федерации
Калининградский филиал Международного университета в Москве
Калининградский филиал Московского государственного университета путей сообщения 
"Калининградский филиал Московского государственного университета экономики, статистики и информатики (МЭСИ)"
Калининградский филиал Московского финансово-юридического университета МФЮА
Калининградский филиал Российского университета кооперации 
Калининградский филиал Российского экономического университета имени Г.В. Плеханова
Калининградский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
"Калининградское высшее инженерное ордена Ленина, Краснознамённое училище инженерных войск имени А. А. Жданова"
Калининградский филиал Санкт-Петербургского университета Министерства внутренних дел Российской Федерации
Калининградский филиал Современной гуманитарной академии
филиал Московского государственного университета технологий и управления имени К.Г. Разумовского в г. Калининграде
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Калининграде"
"Институт управления, бизнеса и технологий"
Калужский государственный университет им. К.Э. Циолковского
University of Ottawa
Калужский филиал Всероссийского государственного университета юстиции
Калужский филиал Московского государственного технического университета имени Н.Э. Баумана
Калужский филиал Российского государственного аграрного университета - МСХА имени К.А. Тимирязева 
Калужский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Крымский институт бизнеса
Калужский филиал Современной гуманитарной академии
Калужский филиал Финансового университета при Правительстве Российской Федерации
Кировский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Филиал Российского государственного гуманитарного университета в г. Казане
Дальневосточный филиал Всероссийской академии внешней торговли Министерства экономического развития Российской Федерации
Камчатский государственный технический университет
Камчатский государственный университет им. Витуса Беринга
Филиал Сибирского государственного университета физической культуры и спорта в г. Кемерово
Петропавловск-Камчатский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Филиал Дальневосточного федерального университета в г. Петропавловске-Камчатском
Северо-Кавказская государственная гуманитарно-технологическая академия
Филиал Ростовского государственного экономического университета (РИНХ) в г. Черкесске Карачаево-Черкесской Республики
Филиал Ставропольского института имени В.Д. Чурсина в г. Черкесске
Филиал Южного федерального университета в г. Черкесске Карачаево-Черкесской Республики
Кемеровский государственный институт культуры 
Кемеровский государственный медицинский университет
Кузбасская государственная сельскохозяйственная академия
Кемеровский государственный университет
Кемеровский институт (филиал) Российского экономического университета имени Г.В. Плеханова
Кемеровский технологический институт пищевой промышленности
Кемеровский филиал Современной гуманитарной академии
Кузбасский государственный технический университет имени Т.Ф. Горбачева
Кузбасский институт Федеральной службы исполнения наказаний
Rice University
University of Strasbourg
Кузбасский институт экономики и права
Новокузнецкий институт (филиал) Кемеровского государственного университета
Новокузнецкий филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Новокузнецкий филиал Современной гуманитарной академии
Сибирский государственный индустриальный университет
Сибирский филиал Международного института экономики и права
Филиал Кузбасского государственного технического университета имени Т.Ф. Горбачева в г. Новокузнецке
Филиал Российского государственного профессионально-педагогического университета в г. Кемерово
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Новокузнецке Кемеровской области"
Волго-Вятский институт (филиал) Университета имени О.Е. Кутафина (МГЮА)
Вятский государственный агротехнологический университет
Вятский государственный университет 
Вятский социально-экономический институт
Кировская государственная медицинская академия
Кировский институт иностранных языков
Кировский филиал Московского государственного университета путей сообщения 
Кировский филиал Московского гуманитарно-экономического университета
Кировский филиал Московского университета государственного управления
Кировский филиал Московской финансово-юридической академии
Институт деловой карьеры
Кировский филиал Пермской государственной академии искусства и культуры
Кировский филиал Санкт-Петербургского Гуманитарного университета профсоюзов
Кировский филиал Современной гуманитарной академии
филиал Московского государственного индустриального университета в г. Кирове
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Кирове "
филиал Финансового университета при Правительстве Российской Федерации в г.Кирове
Костромская государственная сельскохозяйственная академия
Костромской государственный университет 
Филиал Российского государственного гуманитарного университета в г. Иваново
Академия маркетинга и социально-информационных технологий - ИМСИТ (г. Краснодар)
Государственный морской университет имени адмирала Ф.Ф. Ушакова 
Институт современных технологий и экономики
"Институт экономики, права и гуманитарных специальностей"
Краснодарский государственный институт культуры 
Краснодарский кооперативный институт (филиал) Российского университета кооперации 
Краснодарский муниципальный медицинский институт высшего сестринского образования
Краснодарский университет Министерства внутренних дел Российской Федерации
Краснодарский филиал Владимирского юридического института Федеральной службы исполнения наказаний
Краснодарский филиал Российского экономического университета им. Г.В. Плеханова 
Краснодарский филиал Современной гуманитарной академии
Краснодарское высшее военное орденов Жукова и Октябрьской Революции Краснознамённое училище имени генерала армии С.М. Штеменко
Кубанский государственный аграрный университет имени И.Т. Трубилина
Кубанский государственный медицинский университет 
Кубанский государственный технологический университет
Кубанский государственный университет
"Кубанский государственный университет физической культуры, спорта и туризма "
Кубанский институт международного предпринимательства и менеджмента 
Кубанский институт социоэкономики и права (филиал) Академии труда и социальных отношений 
Кубанский социально-экономический институт
Международный инновационный университет 
Северо-Кавказский филиал Российского государственного университета правосудия 
Сочинский государственный университет 
Сочинский институт Восточной экономико-юридической гуманитарной академии (филиал)
Сочинский институт курортной рекреации и гостеприимства - филиал Российской международной академии туризма
"Сочинский институт моды, бизнеса и права"
Сочинский институт (филиал) Российского университета дружбы народов
Сочинский институт экономики и информационных технологий
Сочинский филиал Московского автомобильно-дорожного государственного технического университета (МАДИ)
Сочинский филиал Московского института предпринимательства и права
Сочинский филиал Современной гуманитарной академии
Филиал Адыгейского государственного университета в г. Сочи
Филиал Московского нового юридического института в г. Сочи
Филиал Российского государственного социального университета в г. Сочи Краснодарского края
Lehigh University
Филиал Российского государственного университета туризма и сервиса в г. Сочи
Филиал Ростовского государственного университета путей сообщения в г. Краснодаре
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Краснодаре "
Филиал Финансового университета при Правительстве Российской Федерации в г. Краснодаре
Восточно-Сибирский институт туризма - филиал Российской международной академии туризма
Енисейский филиал Сибирского государственного университета водного транспорта (в г. Красноярске)
Институт европейских культур
Красноярский государственный аграрный университет
Красноярский государственный медицинский университет имени профессора В.Ф. Войно-Ясенецкого 
Красноярский государственный педагогический университет им. В.П. Астафьева
Красноярский институт железнодорожного транспорта - филиал Иркутского государственного университета путей сообщения в г. Красноярске
Красноярский институт социально-экономических наук
Красноярский институт экономики - филиал Санкт-Петербургского университета управления и экономики
University of Colorado Anschutz Medical Campus
Красноярский филиал Академии труда и социальных отношений
Красноярский филиал Российского экономического университета имени Г.В. Плеханова
Красноярский филиал Санкт-Петербургского государственного университета гражданской авиации
Красноярский филиал Санкт-Петербургского Гуманитарного университета профсоюзов
Красноярский филиал Современной гуманитарной академии
Красноярский филиал Университета Российской академии образования
"Сибирский институт бизнеса, управления и психологии"
Сибирский федеральный университет 
Сибирский юридический институт МВД России
Сибирский государственный университет науки и технологий имени академика М. Ф. Решетнёва
Филиал Московского психолого-социального университета в г. Красноярске
Филиал Российского государственного гуманитарного университета в г. Красноярске
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Красноярске"
Зауральский гуманитарно-технологический институт
Курганская государственная сельскохозяйственная академия имени Т.С. Мальцева
Курганский государственный университет (КГУ)
Курганский институт железнодорожного транспорта - филиал Уральского государственного университета путей сообщения в г. Кургане
Институт искусства реставрации
Курганский филиал Академии труда и социальных отношений
Курганский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Курганский филиал Современной гуманитарной академии
Курская академия государственной и муниципальной службы (Академия госслужбы) 
Курская государственная сельскохозяйственная академия имени профессора И.И. Иванова
Курский государственный медицинский университет 
Курский государственный университет
Курский гуманитарно-технический институт 
"Курский институт кооперации (филиал) Белгородского университета кооперации, экономики и права"
Курский филиал Орловского юридического института Министерства внутренних дел Российской Федерации
Курский филиал Российского государственного торгово-экономического университета
Курский филиал Современной гуманитарной академии
Курский филиал Финансового университета при Правительстве Российской Федерации
Региональный открытый социальный институт
Региональный финансово-экономический институт
Филиал Московского института государственного управления и права в Курской области
Филиал Московского института права в г. Курске
Юго-Западный государственный университет
Выборгский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации / Прежние наименования / до 20.09.2010 - Филиал Северо-Западной академии государственной службы в г. Выборге 
Выборгский филиал Санкт-Петербургского государственного университета аэрокосмического приборостроения
Филиал Российского государственного гуманитарного университета в г. Калининград
Липецкий государственный педагогический университет
Липецкий государственный технический университет
Липецкий кооперативный институт (филиал) Белгородского университета потребительской кооперации
Институт журналистики и литературного творчества
Липецкий филиал Воронежского института Министерства внутренних дел Российской Федерации
Липецкий филиал Воронежского института Федеральной службы исполнения наказаний
"Липецкий филиал Института менеджмента, маркетинга и финансов"
Липецкий филиал Международного института компьютерных технологий
Липецкий филиал Московской гуманитарно-технической академии
Липецкий филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Липецкий филиал Современной Гуманитарной академии
Липецкий эколого-гуманитарный институт
University of Sheffield
Филиал Института международного права и экономики имени А.С. Грибоедова в г. Липецке
Филиал Московского государственного университета технологий и управления в г. Липецке
филиал Финансового университета при Правительстве Российской Федерации в г.Липецке
Северо-Восточный государственный университет
Академический международный институт
Академический правовой институт
Университет прокуратуры Российской Федерации
Академия Государственной противопожарной службы
Международный независимый эколого-политологический университет
Академия социального управления
Академия сферы социальных отношений
Академия труда и социальных отношений
Академия управления Министерства внутренних дел Российской Федерации
Академия Федеральной службы безопасности Российской Федерации
Академия хорового искусства имени В.С. Попова
Stanford University
Библейско-богословский институт святого апостола Андрея
Военная академия Ракетных войск стратегического назначения имени Петра Великого
Военный университет Министерства обороны РФ
"Военный учебно-научный центр Военно-воздушных сил ""Военно-воздушная академия имени профессора Н.Е. Жуковского и Ю.А. Гагарина"" "
Военный учебно-научный центр Сухопутных войск «Общевойсковая академия Вооруженных Сил Российской Федерации» 
Всероссийская академия внешней торговли Министерства экономического развития Российской Федерации
Всероссийский государственный университет кинематографии имени С.А.Герасимова
Всероссийский государственный университет юстиции (РПА Минюста России)
Высшее театральное училище (институт) им. М.С. Щепкина при Государственном академическом Малом театре Росии
Государственный академический университет гуманитарных наук
Государственный институт русского языка им А.С. Пушкина
Государственный музыкально-педагогический институт имени М.М. Ипполитова-Иванова
Государственный университет по землеустройству
Государственный университет управления
Гуманитарно-Прогностический институт
Гуманитарно-Экологический Институт 
Гуманитарно-экономический институт имени B.C. Черномырдина
Гуманитарно-экономический и технологический институт
Гуманитарный институт (г. Москва)
Гуманитарный институт имени П.А.Столыпина 
Гуманитарный институт телевидения и радиовещания им. М.А. Литовчина
Дипломатическая академия Министерства иностранных дел Российской Федерации
Евразийский открытый институт
Заочный финансово-экономический институт Финансового университета при Правительстве Российской федерации 
Институт автомобильных технологий и управления
Институт бизнеса и дизайна 
Институт бизнеса и права г. Москва
Институт гостиничного и туристического менеджмента
"Институт государственного управления, права и инновационных технологий"
Институт гуманитарного образования и информационных технологий
University of Würzburg
Институт коммерции и права
Институт коммуникативных технологий
Институт Международного Бизнес Образования
Институт международного права и экономики имени А.С.Грибоедова
Институт международной торговли и права
Институт международных социально-гуманитарных связей
Институт международных стандартов учета и управления
Институт международных экономических связей
Институт менеджмента и бизнеса
"Институт менеджмента, экономики и инноваций"
Московский государственный агроинженерный университет имени В. П. Горячкина
Институт Мировой экономики и информатизации
Университет Мировых Цивилизаций им. В.В. Жириновского
Институт Московская высшая школа социальных и экономических наук
Институт недвижимости и строительного бизнеса
Институт непрерывного образования
Институт правовой экономики
Институт практического востоковедения
Институт Практической Психологии и Психоанализа
Институт профессионального образования
Институт профессиональных инноваций
Институт психотерапии и клинической психологии
Институт русского театра
"Институт рыночной экономики, социальной политики и права"
University of Cambridge
Институт современного права и экономики
"Институт современного управления, кино и телевидения"
Институт Содружества Независимых Государств
Институт социальных наук 
Институт стран Востока
Институт театрального искусства им. П.М. Ершова
Институт традиционного прикладного искусства (Московский филиал) Высшей школы народных искусств (института)
Институт управления и информатики
Институт управления и права
"Институт управления, экономики, права и искусства"
Институт экономики и антикризисного управления
Институт экономики и культуры (г. Москва)
Институт экономики и социальных отношений
Институт экономики и управления в промышленности
Tokyo Institute of Technology
Институт языков и культур имени Л.Толстого
Литературный институт имени А.М.Горького
Международная академия бизнеса и управления 
Международная академия оценки и консалтинга
"Международный еврейский институт экономики, финансов и права"
Международный институт гостиничного менеджмента и туризма
Международный институт экономики и права
Международный славянский институт
Международный социально-гуманитарный институт
Международный университет в Москве
Международный юридический институт
Московская академия предпринимательства при Правительстве г. Москвы
Московская академия рынка труда и информационных технологий
Московская академия экономики и права
Московская Высшая Школа Экономики - финансовый институт
Московская государственная академия ветеринарной медицины и биотехнологии имени К.И. Скрябина
Московская государственная академия коммунального хозяйства и строительства 
Московская государственная академия хореографии
Московская государственная консерватория (университет) имени П. И. Чайковского
Московская государственная художественно-промышленная академия имени С. Г. Строганова
"Московская международная высшая школа бизнеса ""МИРБИС"" (Институт)"
Московский авиационный институт (национальный исследовательский университет)
University of Georgia
Московский автомобильно-дорожный государственный технический университет (МАДИ)
Московский архитектурный институт (государственная академия)
Институт современных психологических технологий
Московский городской педагогический университет
Московский городской университет управления Правительства Москвы
Московский государственный академический художественный институт имени В.И. Сурикова
Tel Aviv University
Sun Yat-sen University
Московский государственный вечерний металлургический институт
Московский государственный гуманитарно-экономический университет
Московский государственный гуманитарный университет имени М.А. Шолохова
Московский государственный институт индустрии туризма имени Ю.А. Сенкевича
Московский Государственный Институт Международных Отношений
Московский государственный институт музыки имени А.Г. Шнитке
Московский государственный лингвистический университет
Московский государственный медико-стоматологический университет имени А.И. Евдокимова
Московский государственный областной университет
Московский государственный психолого-педагогический университет
Национальный Исследовательский Московский Государственный Строительный Университет
Московский государственный текстильный университет имени А.Н. Косыгина
Московский государственный технический университет гражданской авиации
Московский государственный технический университет имени Н.Э. Баумана (национальный исследовательский университет)
"Московский государственный технологический университет ""Станкин"""
Московский государственный университет геодезии и картографии 
University of Oxford
Московский государственный университет имени М.В. Ломоносова
Московский государственный университет пищевых производств
Российский университет транспорта
Московский открытый институт
Московский государственный университет технологий и управления имени К.Г. Разумовского
Московский государственный юридический университет имени О.Е. Кутафина
Московский гуманитарно-экономический университет
Московский гуманитарный университет
Московский институт аналитической психологии и психоанализа
Московский институт банковского дела
Московский институт государственного и корпоративного управления
Московский институт государственного управления и права
Московский институт иностранных языков
Московский институт мировой экономики и международных отношений
Московский институт национальных и региональных отношений
Московский институт открытого образования
Московский институт предпринимательства и права
"Московский институт рекламы, туризма, шоу-бизнеса"
Московский институт современного академического образования
"Московский институт телевидения и радиовещания ""Останкино"""
Московский институт управления 
Московский институт управления и сервиса
Московский институт физической культуры и спорта
"Московский институт экономики, политики и права"
Московский институт энергобезопасности и энергосбережения
Московский институт юриспруденции
Московский информационно-технологический университет – Московский архитектурно-строительный институт / Прежние наименования / до 2009 г. - Международный архитектурно-строительный институтдо 2016 г. - Московский архитектурно-строительный институт 
Московский Исламский Университет (Учреждение)
"Московский медицинский институт ""РЕАВИЗ"""
Московский налоговый институт
МОСКОВСКИЙ НОВЫЙ ЮРИДИЧЕСКИЙ ИНСТИТУТ
Московский областной филиал Санкт-Петербургского Гуманитарного университета профсоюзов Институт искусств и информационных технологий
'Xi''an Jiaotong University'
Московский педагогический государственный университет 
Московский пограничный институт Федеральной службы безопасности Российской Федерации
Московский политехнический университет
Московский психолого-социальный университет
Московский социально-педагогический институт
Московский технический университет связи и информатики
Московский технологический институт / Прежние наименования / До 2010 года - Всемирный технологический университет ВТУ 
Queen Mary University of London
Московский транспортный институт
Московский университет имени С.Ю.Витте
Московский университет Министерства внутренних дел Российской Федерации имени В.Я. Кикотя
"Московский университет ""ТУРО"""
Московский филиал автономного образовательного учреждения Ленинградского государственного университета имени А.С. Пушкина
Московский филиал Российской международной академии туризма
Московский финансово-правовой институт 
Московский финансово-экономический институт
Московский финансово-юридический университет МФЮА
Московский художественно-промышленный институт
Московский экономико-финансовый институт
Московский экономический институт
Московский экономический институт Высшая школа Современное образование
Национальный институт бизнеса
Национальный Институт Дизайна
Национальный институт имени Екатерины Великой
Национальный институт моды
Национальный институт современного дизайна
Национальный исследовательский технологический университет «МИСиС»
"Национальный исследовательский университет ""Высшая школа экономики"""
"Национальный исследовательский университет ""МИЭТ"" "
"Национальный исследовательский университет ""МЭИ"" "
"Национальный исследовательский ядерный университет ""МИФИ"""
Останкинский институт телевидения и радиовещания
Первый Московский государственный медицинский университет имени И.М. Сеченова
Первый московский юридический институт
Пограничная академия Федеральной службы безопасности Российской Федерации
Православный Свято-Тихоновский Гуманитарный Университет
Российская академия адвокатуры и нотариата
"Российская академия живописи, ваяния и зодчества Ильи Глазунова"
Российская академия музыки имени Гнесиных
Российская академия народного хозяйства и государственной службы при Президенте Российской Федерации
Российская академия предпринимательства
Российская государственная академия интеллектуальной собственности
Российская государственная специализированная академия искусств
Российская экономическая школа (Институт)
Российский государственный аграрный университет- МСХА имени К.А. Тимирязева
Российский государственный геологоразведочный университет имени Серго Орджоникидзе
Российский государственный гуманитарный университет
Российский государственный социальный университет
Российский государственный технологический университет имени К.Э. Циолковского Московского авиационного института (национального исследовательского университета)
Российский государственный торгово-экономический университет
Российский государственный университет имени А.Н. Косыгина
Российский государственный университет инновационных технологий и предпринимательства
"Российский государственный университет нефти и газа (национальный исследовательский университет) имени И.М, Губкина"
Российский государственный университет правосудия
"Российский государственный университет физической культуры, спорта, молодежи и туризма (ГЦОЛИФК)"
Российский национальный исследовательский медицинский университет имени Н.И. Пирогова
Princeton University
Российский новый университет
Российский православный институт святого Иоанна Богослова
Российский университет дружбы народов
Российский университет театрального искусства - ГИТИС
Российский химико-технологический университет имени Д.И. Менделеева
Российский экономический университет имени Г.В. Плеханова
Свято-Филаретовский православно-христианский институт
Славяно-Греко-Латинская академия
Radboud University
Славянский деловой институт им. К.В. Нечаева (Митрополита Питирима)
Современная гуманитарная академия 
Московский социально экономический институт
Специализированный институт юриспруденции
Столичная финансово-гуманитарная академия
Столичный гуманитарно-экономический институт
Столичный институт иностранных языков
Столичный институт переводчиков
Театральный институт имени Бориса Щукина при Государственном академическом театре имени Евг. Вахтангова
Университет Российской академии образования
"Московский финансово-промышленный университет ""Синергия“"
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Москве"
Финансово-промышленный институт
Финансовый университет при Правительстве Российской Федерации
Школа-студия (институт) имени Вл.И. Немировича-Данченко при Московском Художественном академическом театре имени А.П. Чехова
Московский экономико-правовой институт
Академия гражданской защиты МЧС России
"Институт бизнеса, психологии и управления"
Институт международных экономических отношений
Московская государственная академия физической культуры
Московский открытый юридический институт
Московский физико-технический институт (государственный университет)
Columbia University
Подольский социально-спортивный институт
Российская международная академия туризма
Российская таможенная академия 
Российский государственный аграрный заочный университет
Российский государственный университет туризма и сервиса
Российский университет кооперации
Сколковский институт науки и технологий
University of Western Australia
Филиал Российского государственного гуманитарного университета в г. Балашихе
филиал Российского государственного гуманитарного университета в г. Санкт-Петербург
Филиал Российского государственного гуманитарного университета в г. Самара 
Филиал Российского государственного гуманитарного университета в г. Саратов
Филиал Российского государственного гуманитарного университета в г. Тольятти
Филиал Российского государственного гуманитарного университета в г. Ярославль
Филиал Российского государственного гуманитарного университета в г. Астрахань
Химкинский филиал Российского университета кооперации / Прежние наименования / до 30.03.2005 - Химкинский филиал Московского университета потребительской кооперации 
Международный институт бизнес-образования
Мурманская академия экономики и управления
Мурманский арктический государственный университет
Мурманский государственный технический университет
Мурманский институт экономики - филиал Санкт-Петербургской академии управления и экономики
Мурманский филиал Государственного университета морского и речного флота имени адмирала С.О. Макарова
Мурманский филиал Петербургского государственного университета путей сообщения
Мурманский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Мурманский филиал Санкт-Петербургского Гуманитарного университета профсоюзов
Мурманский филиал Юридического института (г. Санкт-Петербург)
Филиал Международного института экономики и права в городе Мурманске
Волго-Вятский филиал Московского технического университета связи и информатики
Волжский государственный университет водного транспорта 
Дзержинский политехнический институт (филиал) Нижегородского государственного технического университета им. Р.Е. Алексеева
Дзержинский филиал Нижегородского государственного университета им. Н.И. Лобачевского
Aix-Marseille University
Институт Федеральной службы безопасности Российской Федерации (г. Нижний Новгород)
Национальный исследовательский Нижегородский государственный университет им. Н.И. Лобачевского
Нижегородская академия Министерства внутренних дел Российской Федерации
Приволжский исследовательский медицинский университет
Нижегородская государственная сельскохозяйственная академия
Нижегородская правовая академия
Нижегородский (г. Нижний Новгород) филиал Международного юридического института при Министерстве юстиции Российской Федерации
Нижегородский государственный лингвистический университет имени Н.А. Добролюбова
Нижегородский государственный педагогический университет имени Козьмы Минина 
Нижегородский государственный технический университет им. Р.Е. Алексеева
Нижегородский институт менеджмента и бизнеса
Нижегородский институт управления - филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Академия МНЭПУ (Международный независимый эколого-политологический университет) Филиал Нижний Новгород
Нижегородский филиал Академии труда и социальных отношений
Нижегородский филиал Института бизнеса и политики
"Нижегородский филиал Московского государственного университета экономики, статистики и информатики (МЭСИ)"
Harbin Institute of Technology
Нижегородский филиал Московского гуманитарно-экономического университета
"Нижегородский филиал Национального исследовательского университета ""Высшая школа экономики"" "
Нижегородский филиал Российского нового университета
Hampton University
Нижегородский филиал Современной гуманитарной академии
Нижегородский филиал Университета Российской академии образования
Нижегородское высшее военно-инженерное командное училище (военный институт)
Западно-Уральский институт экономики и права
Приволжский филиал Российской академии правосудия (г. Нижний Новгород)
Филиал Московского государственного университета технологий и управления в г. Нижний Новгород
Филиал Московского института права в г. Нижний Новгород
Филиал Российского государственного гуманитарного университета в г. Нижний Новгород
Филиал Сочинского государственного университета в г. Нижний Новгород Нижегородской области
Новгородский государственный университет имени Ярослава Мудрого
Новгородский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Новгородский филиал Санкт-Петербургского института управления и права
Филиал Российского государственного гуманитарного университета в г. Великий Новгород
Новосибирская государственная консерватория (академия) имени М.И. Глинки
Новосибирский государственный аграрный университет
Новосибирский государственный архитектурно-строительный университет (Сибстрин)
Новосибирский государственный медицинский университет
Новосибирский государственный педагогический университет
Новосибирский государственный театральный институт
Новосибирский государственный технический университет
"Новосибирский государственный университет архитектуры, дизайна и искусств"
"Новосибирский государственный университет экономики и управления ""НИНХ"""
Новосибирский институт экономики и менеджмента
"Новосибирский институт экономики, психологии и права"
Новосибирский национальный исследовательский государственный университет 
Новосибирский технологический институт Российского государственного университета им. А.Н. Косыгина
Новосибирский филиал Московской финансово-юридической академии
Новосибирский филиал Российского экономического университета имени Г.В. Плеханова
University of Massachusetts Amherst
Новосибирский филиал Российской академии предпринимательства
Новосибирский филиал Санкт-Петербургского университета управления и экономики
Новосибирский филиал Современной гуманитарной академии
Новосибирский филиал Томского экономико-юридического института
Новосибирский юридический институт (филиал) Национального исследовательского Томского государственного университета
Новосибирское высшее военное командное училище
Новый сибирский институт
Сибирская академия управления и массовых коммуникаций (институт)
Сибирская академия финансов и банковского дела
Сибирский государственный университет водного транспорта
Сибирский государственный университет геосистем и технологий
Сибирский государственный университет путей сообщения
Сибирский государственный университет телекоммуникаций и информатики
Сибирский институт международных отношений и регионоведения
Сибирский институт - филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Сибирский независимый институт
Сибирский университет потребительской кооперации
Филиал Московского института предпринимательства и права в г. Новосибирске
University of Vienna
Johannes Gutenberg University Mainz
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Новосибирске"
"Евразийский институт экономики, менеджмента, информатики"
Омская академия Министерства внутренних дел Российской Федерации
Омская гуманитарная академия
Сибирский юридический университет
Омский государственный аграрный университет имени П.А.Столыпина
Омский государственный медицинский университет
University of Chicago
Омский государственный педагогический университет
Омский государственный технический университет
Омский государственный университет им. Ф.М. Достоевского
Омский государственный университет путей сообщения
Омский институт водного транспорта (филиал) Сибирского государственного университета водного транспорта
Омский институт (филиал) Российского экономического университета имени Г.В. Плеханова
Омский региональный институт
Омский филиал Московского института иностранных языков
Омский филиал Современной гуманитарной академии
Омский филиал Финансового университета при Правительстве Российской Федерации
Омский экономический институт
Сибирская государственная автомобильно-дорожная академия (СибАДИ)
Сибирский государственный университет физической культуры и спорта
Сибирский институт бизнеса и информационных технологий
Филиал Международного института экономики и права в городе Омске
Филиал Столичной финансово-гуманитарной академии в г. Омске
Оренбургский государственный аграрный университет
Оренбургский государственный институт искусств им. Л. и М. Ростроповичей
Оренбургский государственный институт менеджмента
Оренбургский государственный медицинский университет
Оренбургский государственный педагогический университет
Оренбургский государственный университет
Оренбургский институт бизнеса и управления
Оренбургский институт путей сообщения - филиал Самарского государственного университета путей сообщения
Оренбургский институт (филиал) Университета имени О.Е. Кутафина (МГЮА)
Оренбургский институт экономики и культуры
Оренбургский филиал Академии труда и социальных отношений
Оренбургский филиал Института бизнеса и политики
Linyi University
Пензенский филиал Современной гуманитарной академии
Оренбургский филиал Поволжского государственного университета телекоммуникаций и информатики
Оренбургский филиал Российского экономического университета имени Г.В. Плеханова
Оренбургский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
Оренбургский филиал Современной гуманитарной академии
Орский гуманитарно-технологический институт (филиал) Оренбургского государственного университета
Орский филиал Московской финансово-юридической академии
Орский филиал Оренбургского государственного института менеджмента
"Филиал Московского технологического института ""ВТУ"" в г. Оренбурге"
Филиал Российского государственного университета нефти и газа им. И.М. Губкина в г. Оренбурге
Академия Федеральной службы охраны Российской Федерации
Орловский государственный аграрный университет
Орловский государственный институт культуры
Орловский государственный институт экономики и торговли
Орловский государственный университет имени И.С. Тургенева
Орловский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
Орловский юридический институт МВД России
Бурятский филиал Академии труда и социальных отношений
филиал Финансового университета при Правительстве Российской Федерации в г.Орле
Пензенский государственный аграрный университет
Педагогический институт имени В. Г. Белинского Пензенского государственного университета
Пензенский артиллерийский инженерный институт имени Н. Н. Воронова
Пензенский государственный технологический университет
Пензенский государственный университет
Пензенский государственный университет архитектуры и строительства
Пензенский региональный центр высшей школы (филиал) Российского Государственного Университета Инновационных Технологий и Предринимательства
Пензенский филиал Академии МНЭПУ
Пермский государственный аграрно-технологический университет имени академика Д.Н. Прянишникова
Пермская государственная фармацевтическая академия Федерального агентства по здравоохранению и социальному развитию
Пермский военный институт войск национальной гвардии
Пермский государственный гуманитарно-педагогический университет
Пермский государственный институт культуры
Пермский Государственный Медицинский Университет Имени Академика Е.А. Вагнера
Пермский государственный национальный исследовательский университет
Пермский гуманитарно-технологический институт
Пермский институт муниципального управления (Высшая школа приватизации и предпринимательства)
Пермский институт Федеральной службы исполнения наказаний
Пермский институт (филиал) Российского экономического университета имени Г.В. Плеханова
Пермский институт экономики и финансов
Пермский национальный исследовательский политехнический университет 
Пермский филиал Волжского государственного университета водного транспорта
Пермский филиал Евразийского открытого института
"Пермский филиал Московского государственного университета экономики, статистики и информатики (МЭСИ)"
"Пермский филиал Национального исследовательского университета ""Высшая школа экономики"" "
Пермский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Пермский филиал Современной гуманитарной академии
Уральский гуманитарный институт г. Пермь
"Уральский филиал Российской академии живописи, ваяния и зодчества"
Филиал Московского института государственного управления и права в Пермском крае
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Перми"
Владивостокский государственный университет экономики и сервиса 
Удмуртский государственный университет
Дагестанский государственный технический университет
Владивостокский филиал Дальневосточного юридического института Министерства внутренних дел Российской Федерации
Владивостокский филиал Российской таможенной академии
Владивостокский филиал Санкт-Петербургского Гуманитарного университета профсоюзов
Владивостокский филиал Современной гуманитарной академии
Дальневосточный государственный институт искусств
Дальневосточный государственный технический рыбохозяйственный университет
Дальневосточный федеральный университет
Морской государственный университет имени адмирала Г.И. Невельского
Приморский филиал Сибирского университета потребительской кооперации
Тихоокеанское высшее военно-морское училище имени С. О. Макарова
Тихоокеанский государственный медицинский университет Министерства здравоохранения Российской федирации
Филиал Международного института экономики и права в городе Владивостоке
Псковский государственный университет
Псковский филиал Академии права и управления (института)
Псковский филиал Российской международной академии туризма
Филиал Санкт-Петербургского государственного университета культуры и искусств в г. Пскове
Yeshiva University
Technical University of Dresden
Башкирская академия государственной службы и управления при Президенте Республики Башкортостан
Башкирский государственный аграрный университет 
Башкирский государственный медицинский университет
Башкирский государственный педагогический университет им. М.Акмуллы
Башкирский государственный университет
Башкирский институт социальных технологий (филиал) Академии труда и социальных отношений
Башкирский институт физической культуры (филиал) Уральского государственного университета физической культуры
Башкирский кооперативный институт (филиал) Российского университета кооперации
Восточная экономико-юридическая гуманитарная академия
Дагестанский государственный университет
Стерлитамакский институт физической культуры (филиал) Уральского государственного университета физической культуры
Стерлитамакский филиал Башкирского государственного университета 
Уфимский государственный авиационный технический университет
Уфимский государственный институт искусств имени Загира Исмагилова
Уфимский государственный нефтяной технический университет
Уфимский институт коммерции и права
Уфимский институт путей сообщения - филиал Самарского государственного университета путей сообщения
Уфимский филиал Московского государственного гуманитарного университета имени М.А. Шолохова
Уфимский филиал Современной гуманитарной академии
Уфимский юридический институт МВД России
Филиал Столичной финансово-гуманитарной академии в г. Уфе
филиал Финансового университета при Правительстве Российской Федерации в г.Уфе
Байкальский экономико-правовой институт
Бурятская государственная сельскохозяйственная академия имени В.Р. Филиппова
Бурятский государственный университет
Бурятский институт инфокоммуникаций (филиал) Сибирского государственного университета телекоммуникаций и информатики в городе Улан-Удэ
RWTH Aachen University
Восточно-Сибирский государственный институт культуры
Восточно-Сибирский государственный университет технологий и управления
Улан-Удэнский институт железнодорожного транспорта - филиал Иркутского государственного университета путей сообщения
Улан-Удэнский филиал Современной гуманитарной академии
Филиал Российского государственного гуманитарного университета в г. Улан-Удэ 
Дагестанский государственный аграрный университет имени М.М.Джамбулатова
Дагестанский государственный университет народного хозяйства
Дагестанский государственный медицинский университет
Дагестанский государственный педагогический университет
"Дагестанский институт прикладного искусства, дизайна и архитектуры"
Дагестанский филиал Российского государственного педагогического университета им. А. И. Герцена
Дагестанский филиал Университета Российской академии образования
Институт финансов и права
Кавказский светский институт
Махачкалинский филиал Московского автомобильно-дорожного государственного технического университета (МАДИ)
Махачкалинский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Махачкалинский филиал Современной гуманитарной академии
Международная гуманитарно-техническая академия (институт)
Северо-Кавказский (г. Махачкала) филиал Всероссийского государственного университета юстиции
"Северо-Кавказский государственный налоговый институт - филиал Всероссийской государственной налоговой академии Министерства финансов Российской Федерации, г. Махачкала"
Филиал Московского института предпринимательства и права в г. Махачкале
Филиал Российского государственного университета туризма и сервиса в г. Махачкале
Филиал Ростовского государственного экономического университета (РИНХ) в г. Махачкале Республики Дагестан
Филиал Южного федерального университета в г. Махачкале Республики Дагестан 
Калмыцкий государственный университет имени Б.Б. Городовикова
Филиал Российского государственного гуманитарного университета в г. Киров
Карельский институт туризма - филиал Российской международной академии туризма
Петрозаводская Государственная Консерватория им. А. К. Глазунова
Петрозаводский государственный университет
Петрозаводский филиал Петербургского государственного университета путей сообщения
Сыктывкарский государственный университет имени Питирима Сорокина
Ижевский филиал Московского государственного университета путей сообщения
Крымский инженерно-педагогический университет
Мордовский государственный педагогический институт имени М.Е. Евсевьева
Мордовский гуманитарный институт
Национальный исследовательский Мордовский государственный университет им. Н. П. Огарёва
Саранский филиал Нижегородской академии Министерства внутренних дел Российской Федерации
Саранский филиал Современной гуманитарной академии
Арктический государственный институт культуры и искусств 
Высшая школа музыки (институт) Республики Саха (Якутия)
Северо-Восточный федеральный университет имени М.К. Аммосова 
Арктический государственный агротехнологический университет
Якутский институт водного транспорта (филиал) Сибирского государственного университета водного транспорта
Якутский экономико-правовой институт (филиал) Академии труда и социальных отношений
Владикавказский институт моды
Владикавказский институт управления
Владикавказский филиал Современной гуманитарной академии
Горский государственный аграрный университет
Институт цивилизации (г. Владикавказ)
Северо-Кавказский горно-металлургический институт (государственный технологический университет) 
The Scripps Research Institute
Северо-Осетинская государственная медицинская академия
Северо-Осетинский государственный педагогический институт
Северо-Осетинский государственный университет имени Коста Левановича Хетагурова
Академия социального образования
Волжско-Камский филиал Российской международной академии туризма
Институт социальных и гуманитарных знаний
California Institute of Technology
МинДА
Институт управления (г. Набережные Челны)
Казанская государственная академия ветеринарной медицины им. Н.Э. Баумана
Казанская государственная консерватория (академия) имени Н.Г. Жиганова
Cardiff University
Казанский государственный аграрный университет
Казанский государственный архитектурно-строительный университет
Казанский государственный медицинский университет
Казанский государственный университет культуры и искусств
Казанский государственный энергетический университет
Казанский инновационный университет имени В.Г. Тимирясова 
Казанский институт предпринимательства и права
Казанский кооперативный институт (филиал) Российского университета кооперации
Казанский национальный исследовательский технический университет им. А.Н. Туполева-КАИ 
Казанский национальный исследовательский технологический университет 
Казанский (Приволжский) федеральный университет
Казанский филиал Академии труда и социальных отношений
Казанский филиал Волжского государственного университета водного транспорта 
Казанский филиал Московской Академии Предпринимательства при Правительстве Москвы
Казанский филиал Поволжского государственного университета телекоммуникаций и информатики
Казанский филиал Российского государственного университета правосудия (г.Казань)
Казанский филиал Российской международной академии туризма
Казанский филиал Современной гуманитарной академии
Казанский юридический институт МВД РФ
Казанский юридический институт (филиал) Всероссийского государственного университета юстиции
"Казанское высшее военное командное училище (военный институт) (филиал) Военного учебно-научного центра Сухопутных войск ""Общевойсковая академия Вооруженных Сил Российской Федерации"" "
Камский институт искусств и дизайна
Набережночелнинский государственный педагогический университет
Набережночелнинский государственный торгово-технологический институт
Набережно-Челнинский институт Восточной экономико-юридической гуманитарной академии (филиал)
Huazhong University of Science and Technology
University of Hamburg
Набережночелнинский филиал Казанского государственного технического университета им. А.Н. Туполева
Набережночелнинский филиал Казанского инновационного университета имени В.Г.Тимирясова
"Набережночелнинский филиал Поволжской государственной академии физической культуры, спорта и туризма"
Набережночелнинский филиал Современной гуманитарной академии
Нижнекамский химико-технологический институт (филиал) Казанского национального исследовательского технологического университета
Поволжская государственная академия физической культуры спорта и туризма
"Университет управления ""ТИСБИ"""
Филиал Казанского (Приволжского) федерального университета в г. Набережные Челны
Филиал Московского государственного университета культуры и искусств в городе Набережные Челны
Тувинский государственный университет
Хакасский государственный университет им. Н.Ф. Катанова
Хакасский институт бизнеса
Хакасский технический институт Сибирского федерального университета
Донской государственный аграрный университет
Донской государственный технический университет
University of Adelaide
Донской филиал Евразийского открытого института
Донской юридический институт
Инженерно-технологическая академия ЮФУ (ТРТИ) 
Институт водного транспорта имени Г.Я. Седова - филиал Государственного морского университета имени адмирала Ф.Ф.Ушакова
Институт открытого образования
Институт сферы обслуживания и предпринимательства (филиал) Донского государственного технического университета в г. Шахты
Ростовская государственная консерватория (академия) имени С.В. Рахманинова 
Ростовский военный институт ракетных войск имени Главного маршала артиллерии М.И. Неделина
Ростовский государственный медицинский университет 
Ростовский государственный университет путей сообщения
Ростовский государственный экономический университет (РИНХ)
Ростовский (г. Ростов-на-Дону) юридический институт (филиал) Всероссийского государственного университета юстиции
Ростовский институт защиты предпринимателя 
РОСТОВСКИЙ ИНСТИТУТ ИНОСТРАННЫХ ЯЗЫКОВ
"Ростовский институт кооперации (филиал) Белгородского университета кооперации, экономики и права"
Ростовский институт (филиал) Российского экономического университета имени Г.В. Плеханова
Ростовский международный институт экономики и управления
Ростовский-на-Дону филиал Московской академии предпринимательства при Правительстве Москвы
Ростовский социально-экономический институт
Ростовский технологический институт сервиса и туризма (филиал) Южно-Российского государственного университета экономики и сервиса
Ростовский филиал Волжского государственного университета водного транспорта
Ростовский филиал Московского государственного технического университета гражданской авиации
Ростовский филиал Российской академии правосудия (г. Ростов-на-Дону)
Ростовский филиал Российской таможенной академии
University of Illinois at Chicago
Ростовский филиал Санкт-Петербургского государственного университета культуры и искусств
Ростовский филиал Современной гуманитарной академии
Ростовский юридический институт Министерства внутренних дел Российской Федерации
Северо-Кавказский филиал Московского технического университета связи и информатики
Таганрогский институт имени А.П.Чехова (филиал) Ростовского государственного экономического университета
Таганрогский институт управления и экономики
Донской казачий государственный институт пищевых технологий и бизнеса (филиал) Московского государственного университета технологий и управления им. К.Г. Разумовского (ПКУ)
Филиал Московского института предпринимательства и права в г. Ростов-на-Дону
Институт иностранных языков (г. Санкт-Петербург)
Шахтинский институт (филиал) ЮРГПУ(НПИ) им. М.И. Платова
Южно-Российский институт - филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации / Прежние наименования / до 20.0-.2010 - Северо-Кавказская академия государственной службы 
Южный университет (г. Ростов-на-Дону) 
Южный федеральный университет 
Академия права и управления Федеральной службы исполнения наказаний
Рязанский государственный агротехнологический университет имени П.А. Костычева 
Рязанский государственный медицинский университет имени академика И.П. Павлова
Рязанский государственный радиотехнический университет им. В.Ф. Уткина
Рязанский государственный университет имени С.А. Есенина 
Рязанский заочный институт (филиал) Московского государственного университета культуры и искусств
Рязанский институт открытого образования
Рязанский институт управления и права
Рязанский институт (филиал) Московского политехнического университета
Рязанский институт экономики филиал Санкт-Петербургского университета управления и экономики
Рязанский филиал Академии права и управления (института)
Рязанский филиал Московского государственного университета путей сообщения
Рязанский филиал Московского университета Министерства внутренних дел Российской Федерации
Рязанский филиал Современной гуманитарной академии
"Рязанское высшее воздушно-десантное командное училище (военный институт) имени генерала армии В.Ф. Маргелова (филиал) Военного учебно-научного центра Сухопутных войск ""Общевойсковая академия Вооруженных Сил Российской Федерации"""
Современный технический институт
Волжский университет имени В.Н. Татищева (институт)
Международный институт рынка
Поволжский государственный университет сервиса 
Поволжский государственный университет телекоммуникаций и информатики
Поволжский институт бизнеса
Technion – Israel Institute of Technology
Поволжский филиал Международного университета в Москве (гуманитарного)
ИПД
Самарская академия государственного и муниципального управления 
Самарская государственная областная академия (Наяновой)
Самарская государственная сельскохозяйственная академия
Самарская гуманитарная академия
Самарский государственный институт культуры
Самарский государственный медицинский университет
Самарский государственный социально-педагогический университет
Самарский государственный технический университет
Самарский государственный университет путей сообщения
Самарский государственный экономический университет 
Самарский институт - высшая школа приватизации и предпринимательства
Самарский институт (филиал) Российского экономического университета имени Г.В. Плеханова
Самарский национальный исследовательский университет имени академика С.П. Королева
Самарский филиал Волжского государственного университета водного транспорта
Самарский филиал Московского городского педагогического университета
Самарский филиал Новгородского государственного университета имени Ярослава Мудрого
Самарский филиал Санкт-Петербургского Гуманитарного университета профсоюзов
Самарский филиал Современной гуманитарной академии
Самарский филиал Университета Российской академии образования
Самарский юридический институт Федеральной службы исполнения наказаний
Тольяттинская академия управления
Тольяттинский государственный университет
Тольяттинский филиал Института коммерции и права
Тольяттинский филиал Международного института рынка
Тольяттинский филиал Московского государственного университета пищевых производств
Высшая школа печати и медиатехнологий СПбГУПТД
Тольяттинский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации / Прежние наименования / до 20.09.2010 - Филиал Поволжской академии государственной службы имени П.А. Столыпина в г. Тольятти 
Институт дружбы народов Кавказа
Тольяттинский филиал Самарского государственного университета
Тольяттинский филиал Современной гуманитарной академии
Самарский институт индустрии питания и бизнеса (филиал) Московского государственного университета технологий и управления им. К.Г. Разумовского (ПКУ)
Филиал Самарского государственного экономического университета в г. Тольятти
Филиал Самарской гуманитарной академии в г. Тольятти
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Тольятти Самарской области"
Академия Русского балета имени А.Я. Вагановой
Балтийская академия туризма и предпринимательства
Балтийский государственный технический университет ВОЕНМЕХ им. Д.Ф. Устинова
Балтийский Гуманитарный Институт
Балтийский институт иностранных языков и межкультурного сотрудничества
Wuhan University
"Балтийский институт экологии, политики и права"
Военная академия материально-технического обеспечения им. генерала армии А.В. Хрулева
Военная академия связи им. Маршала Советского Союза С.М. Буденного
Военно-космическая академия имени А.Ф. Можайского
Военно-медицинская академия имени С.М. Кирова
"Военно-морской институт радиоэлектроники имени А.С. Попова (филиал) Военного учебно-научного центра Военно-Морского Флота ""Военно-морская академия имени Адмирала Флота Советского Союза Н.Г. Кузнецова"" "
Военный инженерно-технический университет
Военный учебно-научный центр Военно-Морского Флота «Военно-морская академия имени Адмирала Флота Советского Союза Н.Г. Кузнецова»
Восточно-Европейский институт психоанализа
Высшая школа народных искусств (институт)
Санкт-Петербургский институт гостеприимства
Высшая школа экономики в Санкт-Петербурге
Государственный университет морского и речного флота имени адмирала С.О. Макарова
"Институт дизайна, прикладного искусства и гуманитарного образования"
Институт специальной педагогики и психологии
"Институт телевидения, бизнеса и дизайна "
Международный Банковский Институт
Университет при Межпарламентской Ассамблее Евразийского экономического сообщества
Михайловская военная артиллерийская академия 
Морской корпус Петра Великого Санкт-Петербургского военно-морского института
"Национальный государственный университет физической культуры, спорта и здоровья имени П.Ф. Лесгафта, Санкт-Петербург"
Национальный открытый институт России г. Санкт-Петербург
Невский институт управления и дизайна
Невский институт языка и культуры
Первый Санкт-Петербургский государственный медицинский университет им. акад. И. П. Павлова 
Kiel University
Петербургский государственный университет путей сообщения императора Александра I
Петербургский институт иудаики
Российский государственный гидрометеорологический университет
Российский государственный педагогический университет имени А. И. Герцена
Русская Христианская Гуманитарная Академия
Санкт-Петербургская государственная академия ветеринарной медицины
Российский государственный институт сценических искусств
Санкт-Петербургская государственная консерватория (академия) им. Н.А. Римского-Корсакова
Санкт-Петербургская государственная химико-фармацевтическая академия
Санкт-Петербургская государственная художественно-промышленная академия имени А. Л. Штиглица
Санкт-Петербургская юридическая академия
Nanjing University
Korea University
Санкт-Петербургский академический университет - научно-образовательный центр нанотехнологий РАН (Академический университет РАН) 
Санкт-Петербургский военный институт войск национальной гвардии
Санкт-Петербургский горный университет
Санкт-Петербургский государственный аграрный университет
"University of California, Berkeley"
"Санкт-Петербургский государственный академический институт живописи, скульптуры и архитектуры имени И.Е. Репина"
Санкт-Петербургский государственный архитектурно-строительный университет
Санкт-Петербургский государственный институт культуры 
Санкт-Петербургский государственный институт психологии и социальной работы
Санкт-Петербургский государственный лесотехнический университет имени С.М. Кирова
Санкт-Петербургский государственный морской технический университет
Санкт-Петербургский государственный педиатрический медицинский университет 
Санкт-Петербургский государственный технологический институт (технический университет)
Уральский государственный медицинский университет
Санкт-Петербургский государственный торгово-экономический университет 
Санкт-Петербургский государственный университет
Санкт-Петербургский государственный университет аэрокосмического приборостроения
Санкт-Петербургский государственный университет гражданской авиации
Санкт-Петербургский государственный университет кино и телевидения
Санкт-Петербургский государственный университет промышленных технологий и дизайна
Санкт-Петербургский государственный университет телекоммуникаций им. проф. М.А. Бонч-Бруевича
Санкт-Петербургский государственный экономический университет
Санкт-Петербургский государственный электротехнический университет ЛЭТИ им. В.И. Ульянова (Ленина)
Санкт-Петербургский Гуманитарный университет профсоюзов
Санкт-Петербургский имени В.Б. Бобкова филиал Российской таможенной академии
"Санкт-Петербургский институт внешнеэкономических связей, экономики и права"
Санкт-Петербургский институт гуманитарного образования
САНКТ-ПЕТЕРБУРГСКИЙ РЕСТАВРАЦИОННО-СТРОИТЕЛЬНЫЙ ИНСТИТУТ
Санкт-Петербургский институт машиностроения
Санкт-Петербургский институт управления и права
Санкт-Петербургский институт управления персоналом
Санкт-Петербургский Институт экономики и управления
"Санкт-Петербургский институт экономики, культуры и делового администрирования"
Санкт-Петербургский медико-технический институт
"Санкт-Петербургский национальный-исследовательский университет информационных технологий, механики и оптики"
Санкт-Петербургский политехнический университет Петра Великого
Санкт-Петербургский университет Государственной противопожарной службы
Санкт-Петербургский университет Министерства внутренних дел Российской Федерации
Санкт-Петербургский университет технологий управления и экономики
University of Missouri–Columbia
Санкт-Петербургский филиал Медицинского института «РЕАВИЗ»
Санкт-Петербургский филиал Современной гуманитарной академии
Санкт-Петербургский филиал Финансового Университета при Правительстве Российской Федерации
Санкт-Петербургский юридический институт (филиал) Академии Генеральной прокуратуры Российской Федерации
Северо-Западный государственный медицинский университет имени И.И. Мечникова
Северо-Западный (г. Санкт-Петербург) филиал Всероссийского государственного университета юстиции
Северо-Западный институт управления
Северо-Западный открытый технический университет
Северо-Западный филиал Российской академии правосудия (г. Санкт-Петербург)
Юридический институт (Санкт-Петербург)
Национальный исследовательский Саратовский государственный университет имени Н.Г. Чернышевского
Нижнетагильская государственная социально-педагогическая академия
Поволжский (г. Саратов) юридический институт (филиал) Всероссийского государственного университета юстиции
Поволжский институт управления имени П.А. Столыпина - филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Поволжский филиал Московского государственного университета путей сообщения
Саратовская государственная консерватория (академия) им. Л.В. Собинова
Саратовская государственная юридическая академия
Саратовский военный институт войск национальной гвардии
Саратовский государственный аграрный университет имени Н.И. Вавилова
Саратовский государственный медицинский университет имени В. И. Разумовского
Саратовский государственный технический университет имени Гагарина Ю.А.
Саратовский социально-экономический институт (филиал) Российского экономического университета имени Г.В. Плеханова
Самарский филиал Медицинского института «РЕАВИЗ»
Trinity College Dublin
Université libre de Bruxelles
Саратовский филиал Современной гуманитарной академии
Саратовский юридический институт адвокатуры
Энгельсский технологический институт Саратовского государственного технического университета
Сахалинский государственный университет 
Европейско-Азиатский институт управления и предпринимательства
Екатеринбургская академия современного искусства
Екатеринбургский государственный театральный институт
Екатеринбургский филиал Академии труда и социальных отношений
Екатеринбургский филиал Московского государственного гуманитарного университета имени М.А. Шолохова
Екатеринбургский филиал Московского института предпринимательства и права
Екатеринбургский филиал Современной гуманитарной академии
Екатеринбургский филиал Университета Российской академии образования
Институт международных связей
Институт менеджмента и рынка
Нижнетагильский архитектурный институт (филиал) Уральской государственной архитектурно-художественной академии
Нижнетагильский (г. Нижний Тагил Свердловской области) филиал Международного юридического института
Нижнетагильский технологический институт (филиал) Уральского федерального университета имени первого Президента России Б.Н. Ельцина
Нижнетагильский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
"Нижнетагильский филиал Уральского института экономики, управления и права"
Российский государственный профессионально-педагогический университет
Уральская государственная консерватория (академия) имени М. П. Мусоргского 
Уральский государственный аграрный университет
Уральский государственный архитектурно-художественный университет
Уральский государственный горный университет
Уральский государственный лесотехнический университет
Уральский государственный педагогический университет
Уральский государственный университет путей сообщения
Уральский государственный экономический университет
Уральский государственный юридический университет
Уральский институт Государственной противопожарной службы МЧС России
Уральский институт - филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Уральский институт фондового рынка
"Уральский институт экономики, управления и права"
Академия туризма и международных отношений
Уральский технический институт связи и информатики (филиал) Сибирского государственного университета телекоммуникаций и информатики
Уральский федеральный университет имени первого Президента России Б.Н. Ельцина
Уральский филиал Российского государственного университета туризма и сервиса
McMaster University
University of Padova
Уральский филиал Российской школы частного права (института)
Уральский финансово-юридический институт
Уральский юридический институт МВД России
Филиал Международного института экономики и права в городе Екатеринбурге
Филиал Уральского государственного университета путей сообщения в г. Нижнем Тагиле
Филиал Уральского государственного экономического университета в г. Нижнем Тагиле
University of Tokyo
Институт экономики и права (филиал) Академии труда и социальных отношений в г. Севастополе
Ярославский филиал Академии труда и социальных отношений
Крымский филиал государственного морского университета имени адмирала Ф.Ф. Ушакова
Севастопольский государственный университет
Севастопольский филиал Российского экономического университета имени Г.В. Плеханова
Ставропольский государственный аграрный университет
Филиал Московского государственного университета имени М.В. Ломоносова в городе Севастополе 
Военная академия войсковой противовоздушной обороны Вооруженных Сил Российской Федерации имени Маршала Советского Союза А.М. Василевского
Орловский филиал Современной гуманитарной академии
"Смоленская государственная академия физической культуры, спорта и туризма"
Смоленская государственная сельскохозяйственная академия
Смоленская Православная Духовная Семинария Русской Православной Церкви
Смоленский государственный институт искусств
Смоленский государственный медицинский университет 
Смоленский государственный университет 
Смоленский гуманитарный университет
Смоленский институт бизнеса и предпринимательства
Смоленский институт экономики - филиал Санкт-Петербургского университета управления и экономики
Смоленский филиал Академии права и управления (институт)
Смоленский филиал Международного юридического института
Смоленский филиал Московского государственного университета путей сообщения
Смоленский филиал Московского университета Министерства внутренних дел Российской Федерации
Смоленский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Смоленский филиал Современной гуманитарной академии
филиал Московского нового юридического института в г. Смоленске
"Филиал Санкт-Петербургского института внешнеэкономических связей, экономики и права в г. Хабаровск"
Cornell University
Пятигорский государственный университет
Пятигорский медико-фармацевтический институт – филиал Волгоградского государственного медицинского университета
Северо-Кавказский гуманитарный институт
Северо-Кавказский федеральный университет
Волгоградский филиал Московского гуманитарно-экономического университета
Ставропольский государственный медицинский университет
Ставропольский государственный педагогический институт
"Ставропольский институт бизнеса и технологий ""Бизнестранс"""
Ставропольский институт имени В.Д. Чурсина
Ставропольский институт управления
Ставропольский институт экономики и управления имени О.В. Казначеева (филиал) Пятигорского государственного технологического университета 
"Ставропольский кооперативный институт (филиал) Белгородского университета кооперации, экономики и права"
Ставропольский филиал Краснодарского университета Министерства внутренних дел Российской Федерации
Ставропольский филиал Московского института предпринимательства и права
Ставропольский филиал Московского педагогического государственного университета 
Ставропольский филиал Пятигорского государственного лингвистического университета
Ярославское высшее военное училище противовоздушной обороны
Ставропольский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Ставропольский филиал Современной гуманитарной академии
Ставропольский филиал Южно-Российского гуманитарного института
Ставропольский финансово-экономический институт
Технологический институт сервиса (филиал) Донского государственного технического университета в г. Ставрополе Ставропольского края
Филиал Московского технологического университета в г. Ставрополе
Филиал Российского государственного гуманитарного университета в г. Тверь 
Чувашский государственный педагогический университет им. И. Я. Яковлева
Филиал Российского экономического университета имени Г.В. Плеханова в г. Пятигорске Ставропольского края
Филиал Северо-Кавказского федерального университета в г. Пятигорске
Тамбовский государственный музыкально-педагогический институт им. С.В. Рахманинова
Hokkaido University
Claude Bernard University Lyon 1
Тамбовский государственный технический университет 
Тамбовский государственный университет имени Г.Р.Державина
Тамбовский филиал Московского государственного университета культуры и искусств
Тверская государственная сельскохозяйственная академия
Тверской государственный медицинский университет
Тверской государственный технический университет
Тверской государственный университет
Тверской институт экологии и права
Высшая школа предпринимательства
Тверской филиал Московского гуманитарно-экономического университета
Тверской филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
Тверской филиал Современной гуманитарной академии
Филиал Государственной академии славянской культуры в г. Твери
Западно-Сибирский филиал Российской академии правосудия (г. Томск)
Kyoto University
ETH Zurich
Уральский филиал Российского государственного университета правосудия
Дальневосточный филиал Российского государственного университета правосудия
Крымский филиал Российского государственного университета правосудия
Национальный исследовательский Томский государственный университет
Сибирский государственный медицинский университет 
Томский государственный архитектурно-строительный университет
Томский государственный педагогический университет
Томский государственный университет систем управления и радиоэлектроники
Томский институт бизнеса
Томский институт Восточной экономико-юридической гуманитарной академии (филиал)
Чувашский государственный университет имени И. Н. Ульянова
Томский сельскохозяйственный институт - филиал Новосибирского государственного аграрного университета
Чувашский государственный институт культуры и искусств
Томский филиал Кузбасского института Федеральной службы исполнения наказаний (г. Томск)
Томский филиал Московского государственного гуманитарного университета имени М.А. Шолохова
Томский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации 
Томский филиал Современной гуманитарной академии
Томский экономико-юридический институт 
Институт законоведения и управления ВПА
Тульский государственный педагогический университет им. Л.Н.Толстого
Тульский государственный университет 
Тульский (г. Тула) филиал Международного юридического института
Тульский институт управления и бизнеса им. Н.Д. Демидова
Тульский филиал Всероссийского государственного университета юстиции
Тульский филиал Московского государственного университета культуры и искусств
Тульский филиал Московского университета МВД России
Тульский филиал Российского экономического университета имени Г.В. Плеханова
Imperial College London
Тульский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации
Тульский филиал Российской международной академии туризма
Тульский филиал Современной гуманитарной академии
Академический институт прикладной энергетики
Государственный аграрный университет Северного Зауралья
Западно-Сибирский Институт Финансов и Права
Нижневартовский государственный университет
Тюменский государственный университет
Тюменский государственный медицинский университет
Тюменский государственный архитектурно-строительный университет
Тюменский государственный институт культуры
Тюменское высшее военно-инженерное командное училище имени маршала инженерных войск А. И. Прошлякова
"University of Michigan, Ann Arbor"
Магнитогорский Государственный Технический Университет им. Г.И.Носова
Магнитогорская государственная консерватория (академия) имени М.И. Глинки
Грозненский государственный нефтяной технический университет имени академика М. Д. Миллионщикова
Чеченский государственный педагогический университет
Чеченский государственный университет имени А. А. Кадырова
Российский Исламский университет имени Кунта-Хаджи
Чеченский Институт Бизнеса и Управления
Уральский государственный университет физической культуры
Челябинский государственный институт культуры
Южно-Уральский государственный медицинский университет
Южно-Уральский государственный университет
Южно-Уральский государственный гуманитарно-педагогический университет
Челябинский государственный университет
Южно-Уральский государственный университет
Южно-Уральский технологический университет
Южно-Уральский государственный институт искусств имени П.И.Чайковского
Челябинский институт путей сообщения - филиал федерального государственного бюджетного образовательного учреждения высшего профессионального образования `Уральский государственный университет путей сообщения`
Дальневосточный государственный медицинский университет
Дальневосточный государственный университет путей сообщения
Дальневосточный юридический институт МВД РФ
Хабаровский государственный институт культуры
Дальневосточная государственная академия физической культуры
Дальневосточный Институт Международного Бизнеса
Тихоокеанский государственный университет
Хабаровский государственный университет экономики и права
Дальневосточный Институт Иностранных Языков
Дальневосточный институт психологии и психоанализа
Хабаровский пограничный институт ФСБ России
Ижевский государственный технический университет имени М.Т. Калашникова
Ижевская государственная сельскохозяйственная академия
Ижевская государственная медицинская академия
Ульяновский государственный аграрный университет имени П.А. Столыпина
Ульяновский государственный педагогический университет имени И. Н. Ульянова
Ульяновский государственный технический университет
Ульяновский государственный университет
Ярославский государственный медицинский университет
Ярославская государственная сельскохозяйственная академия
Ярославский государственный педагогический университет им. К. Д. Ушинского
Ярославский Государственный Театральный Институт
Ярославский Государственный Технический Университет
Ярославский государственный университет им. П. Г. Демидова
Международная академия бизнеса и новых технологий
Государственная академия промышленного менеджмента имени Н. П. Пастухова (Академия Пастухова)
Черноморское высшее военно-морское училище им. П.С. Нахимова
Кузбасский гуманитарно-педагогический институт Кемеровского государственного университета
Амурский гуманитарно-педагогический государственный университет
Комсомольский-на-Амуре государственный университет
Ханты-Мансийская государственная медицинская академия
Югорский государственный университет
Прикамский социальный институт
Крымский федеральный университет имени В.И. Вернадского
Сибирский государственный институт искусств имени Дмитрия Хворостовского
Адыгейский государственный университет
Адыгейский филиал Кубанского государственного медицинского университета в г. Майкопе
Johns Hopkins University
Northwestern University
"University of California, Los Angeles"
University College London
Адыгейский филиал Российской академии народного хозяйства и государственной службы при Президенте Российской Федерации / Прежние наименования / до 20.09.2010 - Адыгейский филиал Северо-Кавказской академии государственной службы в г. Майкопе 
Майкопский государственный технологический университет
Армавирский государственный педагогический университет
Армавирский механико-технологический институт (филиал) Кубанского государственного технологического университета
Коми республиканская академия государственной службы и управления
Сыктывкарский лесной институт (филиал) Санкт-Петербургского государственного лесотехнического университета имени С.М. Кирова
Нижегородский государственный архитектурно-строительный университет
Альметьевский государственный институт муниципальной службы
Альметьевский государственный нефтяной институт
Заполярный государственный университет имени Н.М. Федоровского
Duke University
PSL University
University of Illinois at Urbana–Champaign
University of Washington - Seattle
University of Toronto
University of Wisconsin–Madison
New York University
McGill University
Iowa State University
University of Montpellier
Yonsei University
University of Notre Dame
University of Hong Kong
Icahn School of Medicine at Mount Sinai
University of Gothenburg
University of Warwick
'École nationale d''administration'
University of Milan
University of Bologna
Newcastle University
University of Alabama at Birmingham
Wageningen University & Research
Arizona State University
Norwegian University of Science and Technology
Western University
University of Cologne
University of Kansas
Autonomous University of Barcelona
Chinese University of Hong Kong
Waseda University
University of Lausanne
University of Calgary
North Carolina State University
Sungkyunkwan University
University of Münster
University of Connecticut
Technical University of Denmark
Université catholique de Louvain
Stony Brook University
Xiamen University
KAIST
Kyushu University
Shandong University
University of Miami
University of Erlangen–Nuremberg
Georgetown University
Hong Kong University of Science and Technology
University of Turin
Tianjin University
London School of Hygiene & Tropical Medicine
Charles University in Prague
Karlsruhe Institute of Technology
University of Cincinnati
Wake Forest University
University of Naples Federico II
Paul Sabatier University
Sichuan University
University of Sussex
"University of California, Riverside"
University of Bordeaux
University of Texas Health Science Center at Houston
University of Leicester
University of Reading
Complutense University of Madrid
Jilin University
Nankai University
Maastricht University
"University of Tennessee, Knoxville"
HEC Paris
South China University of Technology
Virginia Commonwealth University
Colorado State University
Tongji University
University of Houston
University of Florence
Delft University of Technology
Southeast University
University of Tsukuba
University of Auckland
University of Exeter
National and Kapodistrian University of Athens
University of Pisa
City University of Hong Kong
Hong Kong Polytechnic University
Oregon Health & Science University
University of Cape Town
Oregon State University
Virginia Tech
University of East Anglia
Central South University
University of Manitoba
Florida State University
University of Bergen
"Soochow University, China"
King Abdulaziz University
Leipzig University
University of Aberdeen
University of Genoa
Autonomous University of Madrid
University of Massachusetts Medical School
"University of California, Santa Cruz"
University of Lorraine
"University of Maryland, Baltimore"
National Autonomous University of Mexico
University of Valencia
University College Dublin
University of Antwerp
University of Liège
University of the Witwatersrand
University at Buffalo
Laval University
Medical University of Vienna
Beihang University
University of South Florida
Wayne State University
University of Delaware
University of Pavia
University of Kentucky
Louisiana State University
Dalian University of Technology
King Abdullah University of Science and Technology
University of New Mexico
University of Nebraska–Lincoln
Washington State University
China Europe International Business School
George Washington University
University of Lille
University of Rome Tor Vergata
Ruhr University Bochum
University of Duisburg-Essen
Southern Methodist University
'Queen''s University'
Hanyang University
University of Porto
Ulm University
Chinese Academy of Medical Sciences & Peking Union Medical College
Northeastern University
University of York
Friedrich Schiller University Jena
Durham University
Umeå University
Beijing Normal University
University of Granada
University of South Carolina - Columbia
London School of Economics and Political Science
Polytechnic University of Milan
Dalhousie University
National Cheng Kung University
University of Düsseldorf
Eindhoven University of Technology
Hunan University
Aalto University
Versailles Saint-Quentin-en-Yvelines University
Hannover Medical School
International Institute for Management Development
Simon Fraser University
Beijing Institute of Technology
University of Dundee
University of St Andrews
University of the Basque Country
University of Milano-Bicocca
Lancaster University
University of Electronic Science and Technology of China
University of Campinas
University of Belgrade
École des ponts ParisTech
City College of New York
University of Otago
Albert Einstein College of Medicine
Aalborg University
Ben-Gurion University of the Negev
University of Buenos Aires
'Queen''s University Belfast'
Vrije Universiteit Brussel
Drexel University
Federal University of Rio de Janeiro
University of Southern Denmark
Linköping University
Curtin University
University of Marburg
University of Parma
Lanzhou University
China Agricultural University
Pohang University of Science and Technology
Technical University of Berlin
King Saud University
Islamic Azad University
Justus Liebig University Giessen
University of Ljubljana
University of Innsbruck
Jagiellonian University
Pontifical Catholic University of Chile
University of Oregon
University of Technology Sydney
Macquarie University
University of Turku
National Tsing Hua University
Medical University of South Carolina
East China Normal University
University of Victoria
Chongqing University
University of Perugia
Deakin University
University of Regensburg
Griffith University
Kyung Hee University
"University of Oklahoma, Norman"
East China University of Science and Technology
University of Warsaw
Pompeu Fabra University
University of Wollongong
University of Malaya
University of Newcastle
University of Texas at Dallas
Chalmers University of Technology
Queensland University of Technology
Kyungpook National University
"University at Albany, SUNY"
Swedish University of Agricultural Sciences
University of Seville
Vienna University of Technology
University of Coimbra
University of Bari
Aristotle University of Thessaloniki
University of Science and Technology Beijing
University of Twente
Amherst College
Northwestern Polytechnical University
University of Saskatchewan
Indian Institute of Management Ahmedabad
University of Tasmania
'University of Côte d''Azur'
Tampere University
University of Ulsan
Indiana University – Purdue University Indianapolis
São Paulo State University
Zhengzhou University
Texas Tech University
Hiroshima University
Thomas Jefferson University
Capital Medical University
York University
China University of Geosciences
Kansas State University
Chonnam National University
University of Stuttgart
Stockholm School of Economics
Catholic University of the Sacred Heart
University of Mississippi
Stellenbosch University
University of Chile
University of Trieste
Okayama University
University of Clermont Auvergne
Kobe University
Tulane University
Shenzhen University
Saint Louis University
University of Bath
University of Texas Health Science Center at San Antonio
University of Oulu
Vita-Salute San Raffaele University
University of Navarra
Pusan National University
University of Trento
Medical College of Wisconsin
University of Eastern Finland
University of Zaragoza
Martin Luther University Halle-Wittenberg
National Chiao Tung University
University of Catania
University of Colorado Denver
University of Vermont
Indian Institute of Science
University of Guelph
University of Alabama - Tuscaloosa
Syracuse University
University of Central Florida
Polytechnic University of Catalonia
University of Louisville
Shanghai University
University of Santiago de Compostela
University of Siena
Florida International University
Nanjing Agricultural University
Nanjing University of Aeronautics and Astronautics
Nanjing University of Science and Technology
George Mason University
Federal University of Rio Grande do Sul
University of Strathclyde
Scuola Normale Superiore di Pisa
Technical University of Darmstadt
University of Rostock
Beijing University of Chemical Technology
École normale supérieure de Lyon
James Cook University
University of KwaZulu-Natal
Chulalongkorn University
Oklahoma State University
University of Oviedo
Polytechnic University of Valencia
Rovira i Virgili University
Leibniz University Hannover
Huazhong Agricultural University
Xidian University
West Virginia University
Nanjing Medical University
Baylor University
Savoie Mont Blanc University
Technical University of Dortmund
University of Hawaii at Manoa
La Trobe University
University of Ferrara
Rush University
Federal University of Minas Gerais
University of Tennessee Health Science Center
Swarthmore College
Boston College
University of Modena and Reggio Emilia
Western Sydney University
University of Surrey
University of Hull
University of Tromsø – The Arctic University of Norway
Northwest A&F University
NOVA University of Lisbon
"Royal Holloway, University of London"
University of Canterbury
University College Cork
Wuhan University of Technology
University of Potsdam
University of Tehran
University of Tartu
National Yang-Ming University
University of South Australia
RMIT University
University of Zagreb
Colorado School of Mines
Bar-Ilan University
Ulsan National Institute of Science and Technology
University of Bremen
Georgia State University
USI - University of Italian Speaking Switzerland
University of Verona
University of Rennes 1
Carleton University
Polytechnic University of Madrid
University of Konstanz
Hitotsubashi University
"Northeastern University, China"
University of Arkansas - Fayetteville
Rensselaer Polytechnic Institute
Tata Institute of Fundamental Research
University of Nantes
Medical University of Innsbruck
Cairo University
Ewha Womans University
National Technical University of Athens
Mahidol University
Chiba University
Fuzhou University
"China Medical University, Taiwan"
Jinan University
Flinders University
National Central University
Clemson University
Indian Institute of Technology Madras
Mayo Clinic College of Medicine and Science
Brunel University London
San Diego State University
Medical University of Graz
Southwest University
University of Graz
University of Sherbrooke
University of Jyväskylä
Institut Agro
Indian Institute of Technology Bombay
China University of Petroleum
University of Texas at Arlington
Chang Gung University
University of Delhi
Palacký University Olomouc
Middle East Technical University
Illinois Institute of Technology
University of Iceland
Nanjing Tech University
University of Minho
"Institute of Cancer Research, University of London"
University of Udine
University of Pretoria
Auburn University
Swansea University
University of Wisconsin–Milwaukee
University of Burgundy
University of Palermo
Concordia University
Masaryk University
Bocconi University
College of William & Mary
University of Nebraska Medical Center
Eötvös Loránd University
Haverford College
Central China Normal University
Czech Technical University in Prague
Jiangsu University
University Paris-Est Créteil
Brigham Young University
CINVESTAV
Polytechnic University of Turin
University of Salerno
Beijing Jiaotong University
Jiangnan University
University of Aveiro
University of Cagliari
University of Eastern Piedmont
AGH University of Science and Technology
Federal University of São Paulo
Nanjing University of Information Science and Technology
Comenius University in Bratislava
University of St.Gallen
Jeonbuk National University
Sharif University of Technology
"'St George''s, University of London'"
Utah State University
University of Bayreuth
University of Québec at Montreal
Second Military Medical University
"National University of Ireland, Galway"
Rio de Janeiro State University
National University of La Plata
University of Brescia
Indian Institute of Technology Delhi
Toulouse INP
University of La Laguna
Institut national des sciences appliquées de Lyon
Konkuk University
Southern Medical University
Bielefeld University
Cold Spring Harbor Laboratory
University of Plymouth
Henryk Niewodniczański Institute of Nuclear Physics
North China Electric Power University
Ocean University of China
Catholic University of Korea
Courtauld Institute of Art
Boğaziçi University
China University of Mining and Technology
Memorial University of Newfoundland
National Polytechnic Institute
University of New Hampshire
Tilburg University
Tehran University of Medical Sciences
Southern University of Science and Technology
Renmin University of China
Nanjing Normal University
Hefei University of Technology
Donghua University
University of Cantabria
Hacettepe University
Saarland University
Ankara University
Binghamton University
Chung-Ang University
Shinshu University
University of Macau
Swinburne University of Technology
University of Campania Luigi Vanvitelli
Sciences Po
Loughborough University
Loyola University Chicago
University of Texas Medical Branch
Tokyo Metropolitan University
University of Kent
Roma Tre University
University of Calabria
Massey University
University of Haifa
Kanazawa University
University of Wyoming
University of Málaga
Tokyo Medical and Dental University
Istanbul University
University of Johannesburg
University of Texas at San Antonio
University of Ioannina
Zhejiang University of Technology
University of Szeged
University of Fribourg
"University of Maine, Orono"
Tianjin Medical University
Istanbul Technical University
Semmelweis University
Nanchang University
"University of Nevada, Reno"
Warsaw University of Technology
Vilnius University
National University of Defense Technology
Chungnam National University
Yokohama City University
Southwest Jiaotong University
University of Salamanca
Hong Kong Baptist University
Isfahan University of Technology
University of Debrecen
National Chung Hsing University
Oswaldo Cruz Foundation
Victoria University of Wellington
Heriot-Watt University
University of Oklahoma Health Sciences Center
Inha University
University of Crete
Kumamoto University
Otto von Guericke University Magdeburg
King Fahd University of Petroleum and Minerals
Northeast Normal University
University of Greifswald
Indian Institute of Technology Kharagpur
Panjab University
"University of North Texas, Denton"
South China Normal University
Taipei Medical University
Mississippi State University
University of Arkansas for Medical Sciences
University of Missouri-Kansas City
"Birkbeck, University of London"
International School for Advanced Studies
Montana State University - Bozeman
University of Angers
Yangzhou University
Niigata University
Qingdao University
Central Party School of the Communist Party of China
American University of Beirut
Kangwon National University
"University of Maryland, Baltimore County"
Federal University of Santa Catarina
University of Massachusetts Boston
Bangor University
Beijing University of Technology
Antioch College
Ajou University
Army Medical University
Tokyo University of Science
University of Vigo
Beijing University of Posts and Telecommunications
University of Alaska Fairbanks
Augusta University
University of Salento
Technical University of Braunschweig
Quaid-i-Azam University
SUNY Downstate Medical Center
Guangdong University of Technology
Osaka City University
"'Northwest University, Xi''an'"
University of Castilla–La Mancha
Kitasato University
University of Cyprus
"University of the Andes, Colombia"
University of Idaho
Kent State University
Amirkabir University of Technology
Nanjing University of Posts and Telecommunications
Yerevan Physics Institute
University of Essex
South China Agricultural University
Sejong University
Shaanxi Normal University
Air Force Medical University
University of Wuppertal
"Graduate Faculty, General Research Institute For Nonferrous Metals"
University of Lübeck
Yeungnam University
University of Split
Centrale Lille Institut
University of Girona
Örebro University
Hohai University
Shanxi University
University of the Balearic Islands
University of Montana
Ohio University
University of Murcia
National Taiwan University of Science and Technology
Gwangju Institute of Science and Technology
"University of Science, Malaysia"
Federal University of Paraná
Marche Polytechnic University
Belarusian State University
Kaohsiung Medical University
"University of Natural Resources and Life Sciences, Vienna"
Sorbonne Paris Nord University
Wenzhou Medical University
Northern Illinois University
"University of Córdoba, Spain"
National Sun Yat-sen University
University of Patras
Norwegian University of Life Sciences
Tarbiat Modares University
Harbin Medical University
University of Hohenheim
Guangzhou Medical University
University of North Carolina at Charlotte
Ain Shams University
Carl von Ossietzky University of Oldenburg
Gyeongsang National University
"China Medical University, PRC"
University of Siegen
Gustave Eiffel University
University of Jinan
Beijing Forestry University
"Putra University, Malaysia"
'University of L''Aquila'
Kindai University
Nagasaki University
COMSATS University Islamabad
Polytechnic University of Bari
Brazilian Center for Research in Physics (CBPF)
University of Rhode Island
"Open University, UK"
Carlos III University of Madrid
University of Denver
National University of Colombia
University of Toledo
Indian Institute of Technology Kanpur
Adam Mickiewicz University in Poznań
Shizuoka University
University of Basilicata
Miami University
Jawaharlal Nehru University
Old Dominion University
University of Concepción
Harbin Engineering University
University of Alcalá
Graz University of Technology
Ryerson University
Getúlio Vargas Foundation
University of Tours
"University of Nevada, Las Vegas"
Jawaharlal Nehru Centre for Advanced Scientific Research
Federico Santa María Technical University
Hasselt University
University of Messina
University of Wrocław
Juntendo University
Ege University
Aberystwyth University
Federal University of Pernambuco
Benemérita Autonomous University of Puebla
Rutgers University–Newark
Gazi University
University of Alicante
Wesleyan University
"University of California, Merced"
Cranfield University
University of Mons
University of Louisiana at Lafayette
Liverpool John Moores University
Ivane Javakhishvili Tbilisi State University
Jean Monnet University
Sofia University
Graduate University for Advanced Studies
Banaras Hindu University
INSA Toulouse
"All India Institute of Medical Sciences, New Delhi"
Uniformed Services University of the Health Sciences
Indian Institute of Technology Roorkee
Northern Arizona University
Technical University of Kaiserslautern
University of Luxembourg
"City, University of London"
Anhui University
Murdoch University
Chongqing Medical University
University of Orléans
Southern Illinois University Carbondale
Babeș-Bolyai University
University of Brasília
Henan University
University of Brighton
Dongguk University
National Centre for Nuclear Research
University of Insubria
University of Akron
Hangzhou Normal University
Iran University of Science and Technology
Shandong University of Science and Technology
China Pharmaceutical University
National University of Malaysia (UKM)
Norwegian School of Economics
Portland State University
Budapest University of Technology and Economics
Jaume I University
University of Seoul
Gachon University
Polytechnic University of Bucharest
New Mexico State University
Nihon University
University of Stirling
Federal University of ABC
University of Hyogo
East Carolina University
ShanghaiTech University
Inje University
"University of Technology, Malaysia"
Keele University
University of Valladolid
Michigan Technological University
Guangxi University
North Dakota State University
Ningbo University
University of Portsmouth
London Business School
Institut national de la recherche scientifique
Oberlin College
Federal University of Viçosa
Çukurova University
University of Windsor
Tokushima University
Missouri University of Science and Technology
University of Poitiers
Paul Valéry University
"University of Science and Technology, Korea"
Zhejiang Normal University
Ulster University
Northumbria University
Meijo University
North-West University
Shandong First Medical University & Shandong Academy of Medical Sciences
Johannes Kepler University Linz
Pepperdine University
Federal University of Ceará
Federal University of Pelotas
Gabriele d’Annunzio University
Ritsumeikan University
Claremont McKenna College
Makerere University
Shiraz University
Bucknell University
Chungbuk National University
Indian Institute of Technology Guwahati
"University of the Republic, Uruguay"
Bilkent University
National University of Córdoba
Sanford Burnham Prebys Medical Discovery Institute
Medical University of Warsaw
Chiang Mai University
Khalifa University
Mohammed V University
Colgate University
New Jersey Institute of Technology
Lappeenranta University of Technology
Tokyo University of Agriculture and Technology
University of Regina
Tunis El Manar University
Anhui Medical University
University of Franche-Comté
Autonomous University of San Luis Potosí
Yanshan University
Aston University
University of Naples Parthenope
Pomona College
Qingdao University of Science and Technology
Shandong Agricultural University
King Juan Carlos University
University of Limerick
Ehime University
University of Memphis
Xiangtan University
Tokai University
Federal University of São Carlos
University of Upper Alsace
Victoria University
University of Sassari
University of Texas Rio Grande Valley
Ferdowsi University of Mashhad
Shandong Normal University
Taiyuan University of Technology
Wroclaw Medical University
Gifu University
Florida Institute of Technology
Fluminense Federal University
Hunter College
Qatar University
Henan Normal University
Mansoura University
Wrocław University of Science and Technology
Miguel Hernández University of Elche
Federal University of Juiz de Fora
Shahid Beheshti University of Medical Sciences
Cheung Kong Graduate School of Business
Fujian Agriculture and Forestry University
Osaka Prefecture University
Shanghai Normal University
University of A Coruña
University of Tabriz
Hunan Normal University
Hallym University
Marmara University
Hangzhou Dianzi University
Alexandria University
American University
University of Extremadura
Federal University of Rio Grande do Norte
Capital Normal University
Creighton University
Louisiana Tech University
Yamagata University
'Tokyo Women''s Medical University'
University of Toyama
University of Mannheim
University of Bucharest
VetAgro Sup
Academy of Scientific & Innovative Research
Kunming University of Science and Technology
Medical University of Lodz
Sogang University
Nicolaus Copernicus University
Nantong University
Yunnan University
Federal University of Bahia
United States Naval Academy
University of Shanghai for Science and Technology
University of Texas at El Paso
National Taiwan Normal University
SUNY Upstate Medical University
Royal College of Surgeons in Ireland
Federal University of Santa Maria
Babson College
Mohamed First University Oujda
Chuo University
Rouen Normandy University
Brandenburg University of Technology
Jadavpur University
Manhattan College
Cadi Ayyad University
Guangzhou University
"University of New England, Australia"
Edith Cowan University
École nationale supérieure de chimie de Montpellier
Sichuan Agricultural University
Gaziantep University
Qufu Normal University
Nanjing Forestry University
Villanova University
Dublin City University
Yıldız Technical University
National Taipei University of Technology
Paderborn University
Kagoshima University
Gunma University
University of Urbino
IMT Atlantique
University of South Bohemia
University of Augsburg
University of New Brunswick
Rochester Institute of Technology
Smith College
Auckland University of Technology
Fordham University
University of Maribor
University of Cádiz
Federal University of Goiás
University of Puerto Rico at Mayagüez
University of Antioquia
Nara Institute of Science and Technology
Florida Atlantic University
Australian Catholic University
Worcester Polytechnic Institute
Dankook University
University of Salzburg
Singapore University of Technology and Design
Jichi Medical University
Kharkov Institute of Physics and Technology
University of Jaén
Hassan II University of Casablanca
Fujian Normal University
University of North Carolina at Greensboro
Mersin University
Medical University of Silesia
Paracelsus Medical University
Aga Khan University
Zhejiang Sci-Tech University
University of Novi Sad
Fujian Medical University
Nagoya City University
Medical University of Gdańsk
Charles Darwin University
Åbo Akademi University
University of Pécs
Charles Sturt University
Indian Association for the Cultivation of Science
Pablo de Olavide University
University of Lleida
Toho University
College of the Holy Cross
University of Calcutta
Liverpool School of Tropical Medicine
University of Hertfordshire
Copenhagen Business School
Loma Linda University
Visva-Bharati University
University of Thessaly
"University of Veterinary Medicine, Vienna"
Shahid Beheshti University
Teikyo University
University of Neuchâtel
Maria Sklodowska-Curie National Research Institute of Oncology
University of Kassel
'University of Évry Val d''Essonne'
Manchester Metropolitan University
Institute of Science and Technology Austria
University of Waikato
University of Canberra
University of Massachusetts Lowell
"University of Chemistry and Technology, Prague"
"California State University, Fresno"
Chemnitz University of Technology
Soonchunhyang University
Hubei University
National Institute of Public Health (INSP)
South Dakota State University
Ramon Llull University
"Indian Institute of Science Education and Research, Pune"
Kyoto Prefectural University of Medicine
Tokat Gaziosmanpaşa University
Tiangong University
Postgraduate Institute of Medical Education and Research
Shantou University
Shanghai University of Finance and Economics
Metropolitan Autonomous University
San Francisco State University
Federal University of São João del-Rei
Wright State University
Marquette University
New York Medical College
University of Silesia in Katowice
Aligarh Muslim University
National Defense Medical Center
Mie University
Dokuz Eylül University
University of Sfax
Yamaguchi University
İzmir Institute of Technology
École centrale de Lyon
Jiangsu Normal University
Hofstra University
Howard University
Addis Ababa University
Bowdoin College
Pukyong National University
United States Military Academy
Luleå University of Technology
Stevens Institute of Technology
Ibero-American University
Chung Shan Medical University
Jacobs University
Magna Graecia University of Catanzaro
Koç University
University of Las Palmas de Gran Canaria
West University of Timișoara
University of the Free State
Guizhou University
Osnabrück University
University of Yamanashi
University of Ibadan
Anna University
Santa Clara University
University of Missouri-St. Louis
Hebei University of Technology
Khon Kaen University
Maynooth University
Adıyaman University
University of Western Brittany
'Sant''Anna School of Advanced Studies'
Nippon Medical School
University of Dayton
"California Polytechnic State University, San Luis Obispo"
Tokyo Medical University
TOBB University of Economics and Technology
Wilfrid Laurier University
Poznan University of Medical Sciences
Changzhou University
Prince of Songkla University
Nottingham Trent University
Northeast Forestry University
Tianjin University of Technology
Clark University
Assiut University
"Asia University, Taiwan"
Oakland University
University of North Dakota
Indian Agricultural Research Institute
Kanazawa Institute of Technology
Erciyes University
Albany Medical College
Kafkas University
Federal University of Mato Grosso do Sul
Menlo College
Nanjing University of Chinese Medicine
University of Alabama in Huntsville
Macau University of Science and Technology
Asian Institute of Management
Fu Jen Catholic University
University of Gdańsk
Jikei University
Suez Canal University
University of the Ryukyus
Yokohama National University
Federal University of Pará
Toulouse 1 Capitole University
University of Bradford
University of Picardie Jules Verne
"University of Puerto Rico, Medical Sciences Campus"
Carol Davila University of Medicine and Pharmacy
Hebei University
Huaqiao University
Dong-A University
Monterrey Institute of Technology and Higher Education
Andrés Bello University
Brock University
Dalian Maritime University
"University of the West of England, Bristol"
Catholic University of America
Conservatoire national des arts et métiers
Jiangxi Normal University
Nagasaki Institute of Applied Science
Federal University of Paraíba
Hunan Agricultural University
University of Lodz
Dalian Medical University
Northeast Agricultural University
Daegu Gyeongbuk Institute of Science and Technology
University of Hyderabad
Gran Sasso Science Institute
Süleyman Demirel University
University of Western Cape
Texas State University
Fujita Health University
Federal University of Espírito Santo
Saitama Medical University
University of Algarve
University of Southern Queensland
Chung Yuan Christian University
Saitama University
Boise State University
Henan University of Science and Technology
SOAS University of London
University of Namur
Kasetsart University
Kōchi University
United Arab Emirates University
University of the Punjab
'Ca'' Foscari University of Venice'
Czech University of Life Sciences Prague
Austral University of Chile
Public University of Navarre
Qilu University of Technology
K. N. Toosi University of Technology
"École supérieure de chimie, physique, électronique de Lyon"
Saga University
Wenzhou University
XLRI - Xavier School of Management
"Vietnam National University, Hanoi"
Hirosaki University
University of Camerino
Guangxi Medical University
Federal University of Uberlândia
SUNY College of Environmental Science and Forestry
Bowling Green State University
Tottori University
Tuscia University
National Institute for Space Research (INPE)
"Institute of Physics, Azerbaijan National Academy of Sciences"
'Chang''an University'
Linnaeus University
National University of Distance Education
Lakehead University
Vellore Institute of Technology
Bournemouth University
Campus Bio-Medico University
'University of Pau and Pays de l''Adour'
Hyogo College of Medicine
State University of Maringá
University of Almería
Hebei Medical University
"California State University, Fullerton"
Keimyung University
'Xi''an University of Technology'
"California State University, Northridge"
École des Hautes Études en Sciences Sociales
Medical University Sofia
Zagazig University
Brno University of Technology
Showa University
Fukuoka University
National Taiwan Ocean University
Heilongjiang University
Hiroshima Institute of Technology
Atatürk University
Shanghai University of Traditional Chinese Medicine
Trent University
Shenyang Pharmaceutical University
University of Foggia
University of Miyazaki
Chosun University
Babol Noshirvani University of Technology
Pavol Jozef Šafárik University in Košice
Rhodes University
Anhui Normal University
Fayoum University
Kurume University
Federal University of Lavras
Erzincan Binali Yıldırım University
Zhejiang A&F University
University of Yaoundé I
Warsaw University of Life Sciences
Autonomous University of Nuevo León
Wuhan University of Science and Technology
Gdańsk University of Technology
Soongsil University
University of León
Hainan University
University of Limoges
Mashhad University of Medical Sciences
National Kaohsiung University of Science and Technology
Kuwait University
National University of Rosario
University of Central Lancashire
National Chung Cheng University
National Chengchi University
Antonio Nariño University
Coventry University
Uludağ University
University of Agriculture Faisalabad
University of Ghana
Okinawa Institute of Science and Technology
Southern Cross University
University of Carthage
Isfahan University of Medical Sciences
Ontario Tech University
University of Malawi
Selçuk University
Oxford Brookes University
Kwansei Gakuin University
Jordan University of Science and Technology
Democritus University of Thrace
British University in Egypt
Guangxi Normal University
University of Guadalajara
Lodz University of Technology
University of Toulouse-Jean Jaurès
University of Monastir
University of Stavanger
Southwest University of Science and Technology
San Jose State University
Singapore Management University
Western Michigan University
University of Greenwich
Changsha University of Science and Technology
University of South Alabama
Institute of Tropical Medicine Antwerp
Carleton College
Shimane University
CY Cergy Paris University
Istanbul University-Cerrahpaşa
"Indian Institute of Science Education and Research, Kolkata"
University of the Aegean
Nagoya Institute of Technology
University of Perpignan
University of Costa Rica
Henan Polytechnic University
Bohai University
Sultan Qaboos University
Özyeğin University
"National Institute of Technology, Rourkela"
Iran University of Medical Sciences
Southwest Petroleum University
University of Electro-Communications
"University of Santiago, Chile"
Feng Chia University
Southwestern University of Finance and Economics
Savitribai Phule Pune University
University of Reims Champagne-Ardenne
École de technologie supérieure
Institute for Pure and Applied Mathematics (IMPA)
Grinnell College
Williams College
Jeju National University
Royal Veterinary College
Manipal Academy of Higher Education
Silesian University of Technology
University of the Sunshine Coast
Taras Shevchenko National University of Kyiv
"California State University, Long Beach"
China Jiliang University
University of Occupational and Environmental Health Japan
Cha University
University of Beira Interior
Wuhan Institute of Technology
Akdeniz University
Xuzhou Medical University
University of Isfahan
Clarkson University
Leuphana University of Lüneburg
Michoacán University of San Nicolás of Hidalgo
Fairfield University
Northwest Normal University
Xinjiang University
University of South Africa
Doshisha University
University of Lethbridge
Pontifical Catholic University of Rio Grande do Sul
University of South Dakota
University of Minnesota Duluth
University of Nairobi
Hanken School of Economics
State University of Londrina
University of Southern Mississippi
Tôn Đức Thắng University
Doğuş University
Liaocheng University
Baruch College
University of Jordan
Kagawa University
Tianjin University of Science and Technology
Jiangsu University of Science and Technology
Fukushima Medical University
Shiga University of Medical Science
Pontifical Catholic University of Valparaíso
University of South China
University of Huelva
King Saud bin Abdulaziz University for Health Sciences
Kwame Nkrumah University of Science and Technology
Karadeniz Technical University
Technical University of Ilmenau
Witten/Herdecke University
University of Évora
Tamkang University
Tallinn University of Technology
Kyoto University of Education
Ilia State University
Education University of Hong Kong
Texas Tech University Health Sciences Center
Alexandru Ioan Cuza University of Iaşi
Nova Southeastern University
University of Caen Normandy
University of San Francisco
National University of Sciences and Technology
Freiberg University of Mining and Technology
Henan Agricultural University
University of Salford
Guglielmo Marconi University
I-Shou University
Yuan Ze University
National University of Cuyo
Lincoln University
University of Trás-os-Montes and Alto Douro
University of Veterinary Medicine Hanover
University of La Frontera
Hamburg University of Technology
Sapporo Medical University
Ball State University
Anhui University of Technology
Ochanomizu University
Tanta University
Arts et Métiers Sciences et Technologies
South Central University for Nationalities
Central Michigan University
Anglia Ruskin University
University of Lincoln
Federal University of Technology - Paraná
Kookmin University
Duy Tân University
Illinois State University
Myongji University
Ibaraki University
'École nationale vétérinaire d''Alfort'
Shiraz University of Medical Sciences
Zhejiang Gongshang University
Iuliu Hațieganu University of Medicine and Pharmacy
National Institute of Amazonian Research (INPA)
Texas Christian University
National University of the Littoral
University of Avignon
University of Tulsa
Fırat University
Maria Curie-Skłodowska University
Montclair State University
Incheon National University
Kyushu Institute of Technology
Pomeranian Medical University in Szczecin
Western Norway University of Applied Sciences
Istanbul Bilgi University
Hamamatsu University School of Medicine
Shanghai Ocean University
Chongqing University of Posts and Telecommunications
University of Guilan
DePaul University
University of Sannio
Hebei Normal University
Seoul National University of Science and Technology
Poznań University of Technology
"Queens College, City University of New York"
Qingdao Agricultural University
Utah Valley University
Istanbul Aydın University
Eastern Virginia Medical School
Vienna University of Economics and Business
Cayetano Heredia Peruvian University
University of Huddersfield
"Indian Institute of Technology (Indian School of Mines), Dhanbad"
Helwan University
Indian Institute of Technology Indore
Razi University
Guangzhou University of Chinese Medicine
Poznań University of Life Sciences
University of Rijeka
International Islamic University Malaysia
"Federal Institute of Education, Science and Technology of Rio Grande do Sul"
Indian Institute of Technology (BHU) Varanasi
Tabriz University of Medical Sciences
Rikkyo University
Federal University of Sergipe
Wakayama Medical University
Sabancı University
Medical University of Lublin
University of Guanajuato
University of Latvia
Thapar Institute of Engineering and Technology
Shaanxi University of Science and Technology
Middlesex University
Shihezi University
Norwegian School of Sport Sciences
National University of Mar del Plata
Trinity University
Ohio Wesleyan University
Guilin University of Electronic Technology
Pontifical Catholic University of Rio de Janeiro
"Birla Institute of Technology and Science, Pilani"
'King Mongkut''s University of Technology Thonburi'
North China University of Science and Technology
Semnan University
Lanzhou University of Technology
De Montfort University
Shanxi Medical University
Cooper Union
"Indian Statistical Institute, Kolkata"
Bu-Ali Sina University
Claremont Graduate University
University of Zambia
Cleveland State University
Shanghai Maritime University
Pontifical Javeriana University
Inner Mongolia University
MARA University of Technology
Slovak University of Technology in Bratislava
Tamil Nadu Dr. M.G.R. Medical University
Anhui Agricultural University
Sheffield Hallam University
China Three Gorges University
Yantai University
Tianjin Normal University
Pontifical Catholic University of Peru
Beni Suef University
University of Trier
Iwate Medical University
Al-Azhar University
Glasgow Caledonian University
University of Niš
Harokopio University
Indian Institute of Technology Hyderabad
Georgia Southern University
University Paris 1 Panthéon-Sorbonne
Liaoning University
Lithuanian University of Health Sciences
University of Fukui
Kongju National University
Kwangwoon University
National Dong Hwa University
Federal Rural University of Pernambuco
University of Massachusetts Dartmouth
University of Agder
Aichi Medical University
Shahid Bahonar University of Kerman
University of Valparaíso
Kunming Medical University
Brooklyn College
University of Peradeniya
Chengdu University of Technology
Polytechnic University of Cartagena
Iwate University
Indian Institute of Management Calcutta
University of Warmia and Mazury in Olsztyn
Shenyang Agricultural University
North University of China
Rowan University
Wonkwang University
Ariel University
Harbin University of Science and Technology
Medical University of Białystok
"National Institute of Technology, Tiruchirappalli"
University of North Carolina Wilmington
Gangneung-Wonju National University
Laurentian University
University of Indonesia
"Vietnam National University, Ho Chi Minh City"
Mimar Sinan Fine Arts University
Nara Medical University
Polytechnic University of Hauts-de-France
Bharathiar University
Ondokuz Mayıs University
Kocaeli University
Yangtze University
Western Washington University
"California State University, Los Angeles"
University of La Rioja
Nelson Mandela University
Hunan University of Science and Technology
University of New Orleans
Beijing University of Chinese Medicine
University of South Wales
Kingston University
Beaux-Arts de Paris
Grigore T. Popa University of Medicine and Pharmacy
National University of the South
University of Leoben
Tzu Chi University
Chapman University
University of Kashan
University of Molise
Catholic University of the North
College of Charleston
Open University of Catalonia
University of Kragujevac
Thammasat University
Kyorin University
Guangdong Medical University
Changchun University of Science and Technology
Payame Noor University
Shandong University of Technology
Estonian University of Life Sciences
Georgian Technical University
Agricultural University of Athens
ISCTE – University Institute of Lisbon
University of Québec at Trois-Rivières
Transilvania University of Brașov
Homi Bhabha National Institute
'Xi''an University of Architecture and Technology'
Yazd University
Central European University
Comillas Pontifical University
Anadolu University
James Madison University
Naval Postgraduate School
University of Westminster
University of Ruhuna
Akita University
Indian Institute of Technology Bhubaneswar
Institute for Nuclear Research of the National Academy of Sciences of Ukraine
Central Queensland University
"Institute of Physics, Polish Academy of Sciences"
PLA University of Science and Technology
University of Jammu
Menoufia University
'St. John''s University'
Zhejiang Chinese Medical University
AgroSup Dijon
Catholic University of Portugal
University of the West of Scotland
Marshall University
Federal University of Rio Grande
Pontifical Catholic University of Paraná
Beijing Technology and Business University
Japan Advanced Institute of Science and Technology
Appalachian State University
Oslo Metropolitan University
University of Malta
South Dakota School of Mines and Technology
University of Rajasthan
Amrita Vishwa Vidyapeetham
"University of San Francisco, Quito"
University of Arkansas at Little Rock
BI Norwegian Business School
Nanchang Hangkong University
Hongik University
Urmia University
University of Gondar
'Saint Mary''s University'
Henan University of Technology
Jamia Millia Islamia
University of Cassino and Southern Lazio
Idaho State University
Technical University of Crete
Dongguan University of Technology
New Mexico Institute of Mining and Technology
V.M. Glushkov Institute of Cybernetics of the National Academy of Sciences of Ukraine
Roskilde University
Union College
Shanghai University of Electric Power
St. Marianna University School of Medicine
Washington and Lee University
Eskişehir Osmangazi University
'Sookmyung Women''s University'
Mendel University in Brno
"California State University, Sacramento"
Architectural Association School of Architecture
University of Shizuoka
University of Koblenz-Landau
"University of Puerto Rico, Río Piedras Campus"
Cyprus University of Technology
University of South-Eastern Norway
IFP School
Eulji University
University of the Philippines Manila
Federation University Australia
N.N. Bogolyubov Institute for Theoretical Physics of the National Academy of Sciences of Ukraine
Diego Portales University
Free University of Bozen-Bolzano
University of La Rochelle
Kütahya Dumlupınar University
Kyoto Institute of Technology
Federal University of Mato Grosso
Oita University
Hamilton College
University of Zimbabwe
Zhengzhou University of Light Industry
Suranaree University of Technology
Kansai Medical University
Mae Fah Luang University
University of Technology of Belfort-Montbéliard
Hankuk University of Foreign Studies
Dokkyo Medical University
Yunnan Normal University
University of Technology of Compiègne
Düsseldorf Art Academy
University of Sharjah
Humanitas University
Kanagawa University
East Tennessee State University
University of Notre Dame Australia
Ludong University
China West Normal University
Hebei Agricultural University
Sanjay Gandhi Postgraduate Institute of Medical Sciences
'Institut supérieur de l''aéronautique et de l''espace'
Bahçeşehir University
Central University of Venezuela
Zhongnan University of Economics and Law
Technological Institute of Aeronautics
European University Institute
Catholic University of Daegu
Shanghai Institute of Technology
Meiji University
Guru Nanak Dev University
Towson University
National United University
Kennesaw State University
Mid Sweden University
Manisa Celal Bayar University
Polytechnic Institute of Porto
Xinjiang Medical University
University of Peshawar
University of Zielona Góra
University of Bialystok
University of Agriculture in Krakow
Federal University of Campina Grande
"Goldsmiths, University of London"
University of Mazandaran
King Khalid University
'Nara Women''s University'
Guilin University of Technology
Wellesley College
Kawasaki Medical School
Xinyang Normal University
Franklin & Marshall College
Tunghai University
Sichuan Normal University
Minia University
University of the Philippines Diliman
Federal University of Triângulo Mineiro
Alfaisal University
University of Winnipeg
Pamukkale University
Chubu University
"Institute of Physical Chemistry, Polish Academy of Sciences"
Kyoto Sangyo University
Karlstad University
Kaunas University of Technology
Federal University of Ouro Preto
'Xi''an Jiaotong-Liverpool University'
University of Valle
University of Dhaka
University of Nova Gorica
Embry-Riddle Aeronautical University
University of Science and Technology Houari Boumediene
Autonomous University of Sinaloa
National University of Comahue
Bahauddin Zakariya University
Xinxiang Medical University
PETRONAS University of Technology
Industrial University of Santander
Taibah University
Sakarya University
Guangdong Pharmaceutical University
National Defense Medical College
University of Toulon
University of Burgos
Hamad Bin Khalifa University
University of Madras
Wrocław University of Environmental and Life Sciences
University of Alaska Anchorage
International University of Health and Welfare
University of Talca
Florida Agricultural and Mechanical University
University of the Highlands and Islands
Malmö University
Rajiv Gandhi University of Health Sciences
"Indian Institute of Science Education and Research, Bhopal"
ESCP Europe
Drew University
Central South University of Forestry and Technology
Bond University
Annamalai University
Mediterranean University of Reggio Calabria
Osaka Medical College
Federal University of Alagoas
Near East University
Government College University Faisalabad
Başkent University
Necmettin Erbakan University
University of La Réunion
"Institute of Chemical Technology, Mumbai"
IHE Delft Institute for Water Education
Interdisciplinary Center Herzliya
University of Nigeria
Kettering University
Cracow University of Technology
Benha University
Le Mans University
Duquesne University
"West Pomeranian University of Technology, Szczecin"
Mekelle University
Federal Rural University of Rio de Janeiro
Muhimbili University of Health and Allied Sciences
Indian Institute of Technology Gandhinagar
University of Karachi
Hanbat National University
College of Staten Island
Southwest Medical University
National Yunlin University of Science and Technology
University of Northern British Columbia
University of Ostrava
Sohag University
Institute of Ecology (INECOL)
Technical University of Ostrava
University of Richmond
Shiraz University of Technology
University of Kurdistan
Liaoning Normal University
Jönköping University
Wichita State University
University of Roehampton
"Indian Institute of Engineering Science and Technology, Shibpur"
National Changhua University of Education
Çağ University
Liaoning University of Technology
Gebze Technical University
Van Yüzüncü Yıl University
National Chiayi University
Technological University Dublin
Kanazawa Medical University
Amity University
University of West Bohemia
Jiaxing University
Jilin Agricultural University
Chongqing Technology and Business University
Edinburgh Napier University
Cheikh Anta Diop University of Dakar
Rosalind Franklin University of Medicine and Science
Federal University of Piauí
Nagaoka University of Technology
University of Rzeszów
Autonomous University of Chile
Chongqing Normal University
Aoyama Gakuin University
Kansai University
Tezpur University
Shanghai University of Engineering Science
Imam Abdulrahman Bin Faisal University
Harbin Normal University
Sunchon National University
Kermanshah University of Medical Sciences
Nazarbayev University
Autonomous University of the State of Morelos
Clausthal University of Technology
University of Colorado Colorado Springs
Ningxia Medical University
"Victor Babeș University of Medicine and Pharmacy, Timișoara"
Sivas Cumhuriyet University
Central University of Finance and Economics
Daegu University
Çanakkale Onsekiz Mart University
"Graduate School & Training Center, Research Institute of Petroleum Exploration and Development"
"University of Djillali Liabès, Sidi Bel-Abbès"
Center for Scientific Research and Higher Education of Ensenada
Dicle University
Lebanese University
University of San Diego
Jimma University
İnönü University
Gakushuin University
Baqiyatallah University of Medical Sciences
Ss. Cyril and Methodius University in Skopje
Federal University of Amazonas
University of Québec at Chicoutimi
"Indian Institute of Science Education and Research, Thiruvananthapuram"
Hubei University of Technology
University of Pannonia
Tshwane University of Technology
Punjab Agricultural University
Air Force Engineering University
Hanoi University of Science and Technology
Leeds Beckett University
Tokyo University of Pharmacy and Life Sciences
Guizhou Medical University
Northeast Ohio Medical University
Josip Juraj Strossmayer University of Osijek
SRM Institute of Science and Technology
Dongbei University of Finance and Economics
University of Bergamo
University of Wolverhampton
Chengdu University of Information Technology
Ahvaz Jundishapur University of Medical Sciences
B. Verkin Institute for Low Temperature Physics and Engineering of the National Academy of Sciences of Ukraine
Reykjavík University
Jiangxi Agricultural University
Dalarna University
Open University of the Netherlands
Vilnius Gediminas Technical University
University of Veracruz
Mazandaran University of Medical Sciences
Danube University Krems
Shahrood University of Technology
National University of Tucumán
University of International Business and Economics
SASTRA
Pondicherry University
Sam Houston State University
Sophia University
University of Sousse
Shanxi Normal University
National Institute of Mental Health and Neurosciences
Polytechnic Institute of Bragança
East China University of Technology
Shahid Chamran University of Ahvaz
University of Hawaii at Hilo
University of North Florida
Trinity College
Riga Technical University
Sonoma State University
"National Institute of Pharmaceutical Education and Research, S.A.S. Nagar"
Gadjah Mada University
Santa Catarina State University
Yancheng Institute of Technology
'Xi''an University of Science and Technology'
CEU San Pablo University
Huzhou University
ЕНУ им. Л. Н. Гумилева (бывш. ЦИСИ ЦГПИ)
Университет КАЗГЮУ
МУА (бывш. КазГМА АМИ ЦГМИ)
КРУ (КРСГУ СГА)
КазАТУ им. Сейфуллина (бывш. ЦСХИ АСХИ)
Институт управления
ЕАГИ
Туран-Астана
КФ МГУ им. Ломоносова
КарЭУ Казпотребсоюза (филиал)
КазНУИ  (бывш. КазНАМ)
АФП
КазУТБ (бывш. АкУТБ)
Кайнар (филиал)
Esil University (бывш. КазУЭФМТ филиал КазЭУ им. Т. Рыскулова)
АГУ при Президенте РК
АЭСА (АФ)
КИТА
АФ КазАТК им. М. Тынышбаева
Финансовая академия
ГУТиП им. Д. А. Кунаева (бывш. Университет им. Кунаева КУПС) (филиал)
Назарбаев Университет
ЦАУ (филиал)
КарГТУ (филиал)
КазИнМетр
Институт им. С. Ескараева
Астана
ИСВ
РНИИОТ
МИМ ЛИНК РЦ Астана
ННКЦ
АГИУВ (АФ)
НЦН
МПА «Туран-Профи»
ЕИППП
ННЦОТ
КУ BI Group
АПО при ГП РК
НАО им. И. Алтынсарина
АП при ВС РК
Казахская национальная академия хореографии
Astana IT University
Международный университет Астана (Astana International University – AIU)
Восход (филиал МАИ)
МНЭПУ (филиал)
ИАТЭ НИЯУ МИФИ (представительство)
ЦП РАГС
ИНО УМ (бывш. МГИУ)
КАУ МОК (KAU)
АУЭС (бывш. АИЭС АЭИ)
УМБ (UIB)
Satbayev University (бывш. КазНИТУ им. Сатпаева КазНТУ КазПТИ им В. И. Ленина)
КазНУ им. аль-Фараби (бывш. КазГУ им. Кирова)
Университет Нархоз (бывш. НЭУ им. Т. Рыскулова КазЭУ КазГАУ)
КазГосЖенПУ (ЖенПИ)
AlmaU (бывш. МАБ IAB)
Кайнар
КБТУ (KBTU)
ВШП «Адилет»
ТЭАКТ
ЦАУ
АТУ (бывш. АФ ДТИЛПП)
КазГЮУ (бывш. КазГЮА КазГЮИ)
КИФБА (бывш. АБД ВШБД)
КазУМОиМЯ им. Абылай хана (бывш. АПИИЯ)
КазИИТУ
АГА
Университет «Туран»
УИЯиДК
КазАТиСО
АИМЖ
ЕИнАЭУ (бывш. АЭУ-ЕИР ЕврАзИР)
КИПМО
КазАСТ (бывш. КазИФК)
КРУ (КРСГУ СГА)
АУТБ
КазАДИ им. Гончарова
КазАТК им. Тынышпаева (бывш. АлИИТ ААДИ)
КазНМУ (бывш. АГМИ) им. Асфендиярова
SDU (Suleyman Demirel University СДУ)
КазГАСА
КазНАИ им. Т. Жургенова (бывш. КГХА)
АИЯиП
КазИТУ
Академия «Престиж» (КМИ Парасат)
НУО (бывш. ВА ВС РК ВПКУ КГБ СССР им. Дзержинского)
КНУ (DKU)
АОиС
КазНПУ (бывш. АГУ КазПИ КазГПУ) им. Абая 
АГЭИ (КМИ Парасат)
КНК им. Курмангазы
Академия МВД РК
АЭП
АДТ «Сымбат» (бывш. АБМ «Сымбат»)
КазНАУ (бывш. АЗВИ КазСХИ)
КИМЭП
ВИИРЭиС
ААЭС
СПбГУП АФ
ВШОЗ
ЕЮА им. Д. А. Кунаева (ГУТиП им. Д. А. Кунаева бывш. Университет им. Кунаева)
GCD
Caspian University (бывш. КОУ КИЭП)
МСУ
ТГУ АФ
ЦАУ (филиал)
ВИ СВ (бывш. АВОКУ ВА ВС РК АВВУ ВС РК)
ФЭА
МАПР
ААСИ (КМИ Парасат)
КазМУНО (бывш. АГИУВ)
Казахстанский университет «Алатау» (бывш. КИнЭУ КРМУ)
ЕТУ (бывш. АГТУ)
АЭУ
АТиСО (АФ)
ВИ МО РК (бывш. ВИИЯ МО РК)
Университет «Алматы» (бывш. АУНО)
Улагат
МУИТ (IITU)
ККФА (КМИ Парасат)
НЦПиДХ
Академия КНБ
РосНОУ АФ
РИПК РНПКСО
КУЭиК
ЕУИК «Нур Мубарак»
СГИ «Дарын»
АЦБО
ЦАУ (филиал)
ИВ им. Р. Б. Сулейменова МОН РК
ИСД «Эмили» (КМИ Парасат) 
УНАТ
ИХН им. А. Бектурова
АФП
Даулет
АПС КНБ РК (бывш. ВИ КНБ РК ПА КНБ РК)
ИПИУ НАН РК
КРМУ (бывш. КМУ им. Алиева)
ИМПМБ Данекер
АПДС 
ИГД им. Д. А. Кунаева
Академия РФЦА
КИММ
НИИТ (NIIT Futurtech)
ИПБА
ИЯФ НЯЦ РК
ИМП
НЦКИТ
ИМББ им. М. А. Айтхожина
МНБ РК
КРУ (КРИ КРСГУ СГА)
KAFU (КАСУ)
РЭУ им. Г.  В. Плеханова (филиал бывш. МЭСИ)
ТУСУР (ФДО)
ВКГУ им. Аманжолова
ВКТУ (бывш. СДИ ВКГТУ) им. Д. Серикбаева
АЮ ВШП Адилет
ААЭиС (РУЦДО)
ВГИ
ВКРУ
ЦАУ (филиал)
УМБ (UIB)
КазГЮИУ (представительство)
КарТУ (бывш. КарГТУ КарПИ)
КГМУ (бывш. КГМИ КГМА)
КА МВД РК (КЮИ МВД РК) им. Бейсенова
КЭУ Казпотребсоюза
КРУ (КРСГУ СГА)
МБА (бывш. КУБУП)
КарГУ им. Букетова
Университет им. Кунаева (филиал)
КазФЭУ
Болашак
"""ЦКА (бывш. Фемида СГТИ ЦКУ """"МГТИ-Лингва"""") """
КФИ
КИПКМ
КИ ААЭС
ИПБиА по Центральному Казахстану
Гылым
МЭГА КФ
ФДО ТУСУР
МГТУ
ГМУ (СГМА)
КазГЮИУ (бывш. СУ им. Ауэзова ЮИ КазГЮУ Семей)
КИУ (бывш. КазФЭА КазФЭИ СИБиП)
СГПИ
ГУ им. Шакарима (бывш. СГУ ГФИ ТИ СЗВИ)
Кайнар (филиал)
ЦАУ (филиал)
Кайнар (филиал)
ЖезУ им. Байконурова (бывш. ЖГТИ ЖПИ)
Торайгыров Университет (бывш. ПГУ им. С. Торайгырова ПИИ)
ИнЕУ (бывш. ПаУ)
АЭСА (филиал)
НГИ (филиал)
ППУ (бывш. ПГПИ ППИ)
ПФ ГМУ г. Семей (бывш. СГМА)
КРУ (бывш. СГА)
ТюмГНГУ (ЦДО)
КазГЮУ (УЦДО)
КИПМО (филиал)
КЭУ Казпотребсоюза (ЦДО)
ИИТУБ
КГА
Евразия
ЗКАТУ им. Жангир хана
ЗКИТУ
ЗКГУ им. М. Утемисова (бывш. УПИ им. А. С. Пушкина)
АТиСО (филиал)
КазГЮА
ЗКИТУ (бывш. ЗКГА)
КРМУ (филиал)
КазУИТС
ЦАУ (филиал)
АКИ (филиал)
КазИИТУ (ЗКФ)
ЗКИИ им. Даулеткерея
КРУ (КРСГУ СГА)
МКТУ им. Яссави (филиал)
ТарТИ (бывш. Кайнар)
ТарГУ им. Дулати
ЖГТУ (Аулие-Ата)
ТарГПИ (бывш. ЖПИ)
КазНИИВХ
ДТИЛПП
ААЭС (филиал)
ТИГУ
Тараз
Университет Дулати / Dulaty University
Бурабай
КУ им. Касымова
КУАМ
ГТА (бывш. КИЭМ) 
КГУ им. Ш. Уалиханова
КЮА Фемида (филиал)
КТИ КЧС МВД РК
КРУ (филиал)
АЭСА (филиал)
ВШП «Адилет»
Академия Кокше
СГА (филиал)
ЗЦ ВКГТУ им. Д. Серикбаева 
КГУТИ им. Ш. Есенова (бывш.  АктГУ)
Кайнар (филиал)
ЦАУ (филиал)
КазАТК (филиал)
Болашак
АФ КарГУ им. Е. А. Букетова
МАТ
ВМИ
МГТУ
КРИ СГА (БФ)
БФ КарГТУ (бывш. КарПТИ)
ЦКИТМ (бывш. БГТУ)
ЛФДО РИИ
СГА (ЖФ)
АОиС (филиал)
КарПИ (ЖФ)
ТПУ
АЭП им.  Жолдасбекова
ЖГУ им. Жансугурова (бывш. ТКПИ)
ТКЮИ
Темирказык
AlmaU (бывш. ALMU МАБ IAB)
СГА (филиал)
АИГИ
КРУ (филиал)
АтГУ им. Досмухамедова (бывш. АПИ)
АУНГ (бывш. АИНиГ)
КИЭиП (филиал)
ЗКФ КАУ (МОК)
МТИ «ВТУ»
APEC Petrotechnic
АФ ИМиМ
ЦАУ (филиал)
КРИ
КРУ ЭФ (бывш. СГА ЭФ)
ПГУ им. Торайгырова (ЭФ)
ЭИТИ
ЖенПИ (ЭФ)
Сырдарья
Улагат
КазХТИ
МКТУ им. Яссави (филиал)
АЯ КУДН
Мирас
ААЭС (РЦДО)
ЦДО КазГЮУ (бывш. КазГЮА КазГЮИ)
КРУ (КРИ КРСГУ СГА)
ЮКГИ им. М. Сапарбаева
ЮКОУ
АЭУ (филиал)
ЮКУ им. М. Ауезова (бывш. ЮКГУ)
ТУСУР (ФДО)
ЦДО КазЭУ им. Т. Рыскулова (бывш. КазГАУ Нархоз)
АПиУ
КазАТК им. Тынышпаева (филиал)
УМБ (UIB)
ЮКГФА (бывш. ЮКГМА)
ЦАГЭИ (бывш. ЦАИМЭП)
МГТУ
ШУ
Кайнар (филиал)
ЦПГС аппарата Акима ЮКО 
ЧПИК им. аль-Фараби
ЮКГА (бывш. ККУ)
Отырар (Казахско-арабский)
КИПУДН (бывш. КУДН)
РСИУ (бывш. АИУ ШСПУ)
ШПЦДО КЭУК
ЮКГПИ
ЮКПУ
МКТУ КИ
ВКГТУ (РФ)
ВКГУ (РФ)
Агротехнический институт
ТарГУ им. М. Х. Дулати (ИДО)
КазНТУ (филиал)
СКУ им. М. Козыбаева (бывш. ППИ)
КРУ (КРСГУ СГА)
ПИБиУ
КарГУ им. Букетова (филиал)
СКЮА
ЦАУ (филиал)
ВИ ВВ МВД РК  (ВИ НГ РК бывш. ПВВУВВ МВД РК)
ТюмГУ (представительство)
АркГПИ им. Алтынсарина
РИИ
МПУ (РФ)
КИнЭУ им. Дулатова (УКП)
НУО
ВГАВМ
ВГТУ (бывш. ВТИЛП)
ВГМУ
БГАМ (филиал)
ВФ МИТСО
ВГУ им. Машерова (бывш. ВГПИ)
ИСЗ
ВДС
БрГУ им. А. С. Пушкина
БрГТУ
БГАМ (филиал)
ИСЗ (БФ)
ИТИиУ  БГУ (БФ)
БГУ
БКИУ
МГЭИ им. А. Д. Сахарова БГУ
БГУКИ
БГАМ (бывш. БГК им. Луначарского)
МГГИПКиПКО
БГУФК
ИСЗ им. Широкова
РИВШ
МИЭП МФ
РИИТ БНТУ
БелМАПО
БГМУ
АПО
"БГАА (бывш. МГВАК, МАТУГА)"
ИУП
Академия МВД РБ
БНТУ (Политех)
МФ ЛИС им. Бонч-Бруевича (закрыт)
Энвила
ЕГУ
УГЗ (КИИ) МЧС РБ
БГЭУ (бывш. БГИНХ)
БИП – Университет права
"ВА РБ (бывш. МВВИУ, МВВКУ)"
БГАИ (бывш. БГТХИ)
МИУ
РГСУ МФ
ИПП
МинДС
ИПМ
МФТИ МФ
МинБС
МГВРК
АУпПРБ
МИМ-Беларусь
ВЗЭИС МФ (закрыт)
БГУИР (бывш. МРТИ)
БГТУ (бывш. БТИ им. Кирова)
МГЛУ (бывш. МГПИИЯ)
"""Международный университет """"МИТСО"""""""
БГПУ им. М. Танка
РЭУ им. Г. В. Плеханова МФ (бывш. МЭСИ МФ)
БГАТУ
БГАС (бывш. ВГКС)
МГЭИ (бывш. ГЭНИ)
СГА
МВИЗРУ ПВО (до 1993 г.)
БелГИПК
НАН Беларуси
ИНБ РБ
БГИПК по СМиУК
РНПЦ ЭМ
РИПКМТСЗ РБ
Centre franco-biélorusse
ИПНК НАН Беларуси
РИПО
ИПС РБ
ГИПКП Министерства торговли РБ
"""ИПКиПРиСП """"Кадры индустрии"""""""
ТИ
НИО МО РБ
ГИПКиПК ТО РБ
ГИПК Газ-Институт
ИПКиПК ГКСЭ РБ (бывш. ИПКиП кадров ГСМСЭ)
ЧИУиП
ИИТиБА
НЦЗПИ
БКУУ
ИМ НАН Беларуси
МГПУ им. И. П. Шамякина
ГГМУ
МИТСО (филиал)
ГИИ МЧС РБ
БелГУТ (бывш. БелИИЖТ)
ГГТУ им. П. О. Сухого
ГГУ им. Ф. Скорины
БТЭУ ПК (бывш. ГКИ)
ФБИУ при ГГУ им. Ф. Скорины
Институт радиобиологии НАН Беларуси
Институт леса НАН Беларуси
"БРУ (бывш. МГТУ, ММИ)"
МЧФЭИ им. Ковалева
МГУ им. А.А.Кулешова (бывш. МГПИ)
МГУП
БГАМ (МФ)
БИП
МИ МВД РБ
БГУТ
БарГУ
БГЭУ (филиал)
ПолесГУ
ВГАВМ (филиал)
ВДС им. святого Фомы Аквинского
ПФ БГСХА
ГрГМУ
ГГАУ
БГАМ (филиал)
ГрГУ им. Янки Купалы
СГА (бывш. СГИ)
БИП (филиал)
НИСЗ (ГФ)
ГДС
ИТИиУ БГУ
ПГУ
БФ БГЭУ
БФ ИУиП
ПГУ
БНТУ (филиал)
МФПУ «Синергия»
БГСХА
Московский институт психоанализа
РТУ МИРЭА - Российский технологический университет
Национальный исследовательский Томский политехнический университет
Московская гуманитарно-техническая академия МГТА
Северо-Кавказский социальный институт
"""ФГБОУ ВО """"ЮРГПУ (НПИ) имени М.И.Платонова"""
 Национальный Исследовательский Томский Государственный Университет
Томский Государственный Университет
Донецкий национальный технический университет
Ульяновский институт гражданской авиации имени Главного маршала авиации Б.П. Бугаева
Институт стратегии развития образования Российской академии образования
Автономная некоммерческая организация высшего образования «Северо-Кавказский социальный институт»
"""Северо-Кавказский институт (филиал) федерального государственного бюджетного образовательного учреждения высшего образования """"Всероссийский государственный университет юстиции (РПА Минюста России)"""" в г. Махачкале"""
Медицинский институт реабилитации и косметологии  им. З. М. Никифоровой
Владимирский государственный гуманитарный университет
Академия строительства и архитектуры СамГТУ
Московский областной институт Восточной экономико-юридической гуманитарной академии
"""АНО ВПО """"Владимирский институт бизнеса"""""""
Московский государственный институт культуры
Федеральное государственное организации автономное образовательное учреждение высшего образования первый московский государственный медицинский университет имени И.М. Сеченова министерства здравоохранения российской федерации (Сеченовский университет)
Профессиональная образовательная автономная некоммерческая организация «Национальный университет современных технологий»
Московский Государственный Институт Культуры
Московский банковский институт
Новосибирский Государственный Университет
ФГОБУ ВПО Всероссийская государственная налоговая Академия Министерства финансов Российской Федерации
ФГБОУ ВО Тюменский Индустриальный Университет
БУ ВО Сургутский государственный университет
Федеральное государственное бюджетное образовательное учреждение высшего образования «Южно-Российский государственный политехнический университет (НПИ) имени М.И. Платова»
Федеральное государственное бюджетное образовательное учреждение высшего образования «Тюменский индустриальный университет
Московский экономико-статистический институт
Московский государственный университет коммерции
Ростовский государственный строительный университет
Иркутский государственный университет Педагогический институт
Государственное образовательное учреждение высшего образования Московской области «Государственный социально-гуманитарный университет»
Федеральное государственное автономное образовательное учреждение высшего образования «Национальный исследовательский Томский политехнический университет»
Образовательное частное учреждение высшего образования «Еврейский университет»
Федеральное государственное автономное образовательное учреждение высшего образования «Дальневосточный федеральный университет»
Государственное бюджетное профессиональное образовательное учреждение Ростовской области «Ростовский-на-Дону строительный колледж»
Кировское областное государственное профессиональное образовательное бюджетное учреждение «Кировский сельскохозяйственный техникум имени дважды Героя Социалистического Труда А.Д. Червякова»
Московский техноголический университет
Санкт-Петербургский государственный университет низкотемпературных и пищевых технологий
Федеральное государственное автономное образовательное учреждение высшего образования «Омский государственный технический университет»
Федеральное государственное бюджетное образовательное учреждение высшего образования «Санкт-Петербургский государственный химико-фармацевтический университет» Министерства здравоохранения Российской Федерации
Тюменский государственный медицинский университет
Федеральное государственное бюджетное образовательное учреждение высшего образования «Тюменский индустриальный университет».
Федеральное государственное автономное образовательное учреждение высшего образования «Сибирский федеральный университет»
Государственное образовательное учреждение высшего образования Московской области «Государственный гуманитарно-технологический университет»
Москвоский государственный университет печати имени Ивана Фёдорова
Московский государственный университет прикладной биотехнологии
Федеральное государственное бюджетное образовательное учреждение высшего образования «Мичуринский государственный аграрный университет»
Федеральное государственное бюджетное образовательное учреждение высшего образования «Чувашский государственный аграрный университет»
Автономная некоммерческая организация высшего образования “Гуманитарный университет”
Государственное образовательное учреждение высшего профессионального образования «Донецкий национальный университет»
Государственное образовательное учреждение высшего профессионального образования «Донецкий национальный технический университет»
Федеральное государственное автономное образовательное учреждение высшего образования «Северо-Кавказский федеральный университет»
Федеральное государственное бюджетное научное учреждение «Исследовательский центр частного права имени С.С.Алексеева при Президенте Российской Федерации»
Мытищинский филиал федерального государственного бюджетного образовательного учреждения высшего образования «Московский государственный технический университет имени Н. Э. Баумана (национальный исследовательский университет)»
Федеральное государственное бюджетное образовательное учреждение высшего образования «Российский государственный художественно-промышленный университет им. С.Г. Строганова»
Федеральное государственное бюджетное образовательное учреждение высшего образования «Сибирский государственный университет науки и технологий имени академика М.Ф. Решетнева»
Санкт-Петербургский государственный университет сервиса и экономики
Рыбинский государственный авиационный технический университет имени П.А. Соловьева
Автономная некоммерческая организация «Образовательная организация высшего образования» «Университет экономики и управления» АНО «ООВО» «Университет экономики и управления»
Федеральное государственное бюджетное образовательное учреждение высшего образования «Глазовский государственный педагогический институт имени В.Г. Короленко»
Государственное образовательное учреждение высшего образования Московской области «Государственный социально-гуманитарный университет»
Челябинский институт экономики и права им. М. В. Ладошина
Московский государственный институт культуры
Военная академия бронетанковых войск имени Маршала Советского Союза Р. Я. Малиновского
Дальневосточный государственный технический университет
Федеральное государственное бюджетное образовательное учреждение высшего образования «Дальневосточный государственный аграрный университет»
"Гуманитарно-педагогическая академия (филиал) ФГАОУ ВО ""Крымский федеральный университет имени В.И. Вернадского"""
Федеральное государственное бюджетное образовательное учреждение высшего образования «Алтайский государственный педагогический университет»
Ленинградский государственный университет имени А.С.Пушкина
"Негосударственное образовательное учреждение ""Московский университет экономики, менеджмента и права"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Санкт-Петербургская академия художеств имени Ильи Репина"""
"Негосударственное образовательное учреждение высшего профессионального образования ""Институт психологии и педагогики"""
ОЧУ ВО московская международная академия
"Суздальский филиал федерального государственного бюджетного образовательного учреждения высшего образования ""Санкт-петербургский государственный институт культуры"""
"Автономная некоммерческая организация высшего профессионального образования ""Московская открытая социальная академия"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Великолукская государственная академия физической культуры и спорта"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Владимирский государственный университет имени Александра Григорьевича и Николая Григорьевича Столетовых"""
Самарский государственный технический университет
"Государственное автономное профессиональное образовательное учреждение Саратовской области ""Саратовский колледж строительства мостов и гидротехнических сооружений"""
Калужский коммунально-строительный техникум им. В. А. Чабоненко
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Санкт-Петербургский государственный университет экономики и финансов"""
"Автономная некоммерческая организация высшего образования ""Московский международный университет"""
Федеральное государственное бюджетное образовательное учреждение высшего образования «Университет «Дубна»
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Дальневосточный государственный гуманитарный университет"""
Одесское высшее артиллерийское командное ордена Ленина училище им. М. В. Фрунзе
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Карачаево-Черкесский государственный университет имени У.Д. Алиева"""
"Религиозная организация - духовная образовательная организация высшего образования ""Воронежская духовная семинария Воронежской Епархии Русской Православной Церкви"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Российский государственный художественно-промышленный университет им. С.Г. Строганова"""
"Автономная некоммерческая организация высшего образования ""Московский региональный социально-экономический институт"""
Рязанский военный автомобильный институт имени генерала армии В. П. Дубынина
"Частное учреждение высшего образования ""Южно-Российский гуманитарный институт"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Ухтинский государственный технический университет"""
"Негосударственное образовательное учреждение ""Высший институт управления"""
"Федеральное государственное бюджетное научное учреждение ""Институт коррекционной педагогики"""
"Егорьевский технологический институт (филиал) федерального государственного бюджетного образовательного учреждения высшего образования ""Московский государственный технологический университет ""СТАНКИН"""
"Ишимский педагогический институт им. П.П. Ершова (филиал) федерального государственного автономного образовательного учреждения высшего образования ""Тюменский государственный университет"""
Хабаровский институт инфокоммуникаций (филиал СибГУТИ)
Институт архитектуры и строительства ВолгГТУ
Академия водного транспорта Российского университета транспорта
"Негосударственное высшее образовательное учреждение ""институт современной экономики"""
"Уральский институт управления (филиал федерального государственного бюджетного образовательного учреждения высшего образования ""Российская академия народного хозяйства и государственной службы при Президенте Российской Федерации"")"
Севастопольский экономико-гуманитарный институт (филиал) Крымского федерального университета имени В.И. Вернадского
"Бюджетное учреждение высшего образования Ханты-Мансийского автономного округа Югры ""Сургутский государственный педагогический университет"""
"Филиал федерального государственного бюджетного образовательного учреждения высшего образования Университет ""Дубна"" - Дмитровский институт непрерывного образования"
"Некоммерческое частное образовательное учреждение высшего образования ""Кубанский институт информзащиты"""
"Автономная некоммерческая организация высшего образования ""Международный независимый эколого-политологический университет"""
"Рузаевский институ машиностроения (филиал) федерального государственного бюджетного образовательного учреждения высшего образования ""Национальный исследовательский Мордовский государственный университет им. Н. П. Огарёва"""
"Федеральное государственное казенное образовательное учреждение высшего профессионального образования ""Челябинский юридический институт министерства внутренних дел Российской Федерации"""
"Негосударственное образовательное частное учреждение высшего образования ""Институт моды, дизайна и технологий"""
"Федеральное государственное образовательное учреждение высшего профессионального образования ""Тульский артиллерийский инженерный институт"" министерства обороны российской федерации"
"Государственное автономное образовательное учреждение высшего образования Тюменской области ""Тюменская государственная академия мировой экономики управления и права"""
"Санкт - Петербургское государственное бюджетное профессиональное образовательное учреждение ""Санкт - Петербургское художественное училище имени Н.К. Рериха"""
"Государственное образовательное учреждение высшего профессионального образования ""Коломенское высшее артиллерийское командное училище (военный институт)"" министерства обороны российской федерации"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Приморская государственная сельскохозяйственная академия"""
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Московский государственный горный университет"""
"Государственное образовательное учреждение высшего профессионального образования ""Кемеровское высшее военное командное училище связи (военный институт) имени маршала войск связи И.Т. Пересыпкина министерства обороны Российской Федерации"
"Автономная некоммерческая организация высшего образования ""Университет Иннополис"""
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Южно-Российский государственный университет экономики и сервиса"""
"Негосударственное образовательное учреждение высшего профессионального образования ""Региональный институт психологии и гуманитарных наук"""
"Государственное образовательное учреждение высшего профессионального образования ""Пермский военный институт ракетных войск"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Уфимский Университет Науки и Технологий"""
"Государственное бюджетное образовательное учреждение высшего образования ""Донбасская юридическая академия"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Донбасская национальная академия строительства и архитектуры"""
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Тюменский государственный архитектурно-строительный университет"""
"Федеральное государственное казенное образовательное учреждение высшего профессионального образования ""Саратовский юридический институт министерства внутренних дел российской федерации"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Горно-Алтайский государственный университет"""
"Политехнический институт (филиал) федерального государственного автономного образовательного учреждения высшего образования ""Северо-Восточный федеральный университет имени М. К. Аммосова в г. Мирном"""
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Елецкий государственный университет им. И.А. Бунина"""
"Государственное бюджетное учреждение здравоохранения города Москвы ""Научно-исследовательский институт скорой помощи им. Н.В. Склифосовского Департамента здравоохранения города Москвы"""
"Частное образовательное учреждение высшего образования ""Уральский гуманитарный институт"""
Тест полное имя
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Ставропольский государственный университет"""
"ФГОУ ВПО ""Челябинское высшее военное автомобильное командно-инженерное училище (военный институт) имени главного маршала бронетанковых войск П.А.Ротмистрова"" министерства обороны Российской Федерации"
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Тверской государственный медицинский университет"" министерства здравоохранения российской федерации"
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Технологический университет имени дважды героя советского союза, летчика-космонавта А.А. Леонова"""
"Санкт-Петербургское государственное бюджетное профессиональное образовательное учреждение ""Академия транспортных технологий"""
"Негосударственное некоммерческое высшее учебное заведение ""Алтайская академия экономики и права"""
"Государственное бюджетное профессиональное образовательное учреждение ""Ессентукский центр реабилитации инвалидов и лиц с ограниченными возможностями здоровья"""
"Религиозная организация – духовная образовательная организация высшего образования ""Московская духовная академия Русской Православной Церкви"""
"Федеральное государственное казенное военное образовательное учреждение высшего образования ""Военный институт физической культуры"" министерства обороны российской федерации"
"Частное образовательное учреждение высшего образования Сургутский институт мировой экономики и бизнеса ""Планета"""
"Вольский военный институт материального обеспечения (филиал) федерального государственного казенного военного образовательного учреждения высшего профессионального образования ""Военная академия материально-технического обеспечения имени генерала армии А.В. Хрулева"" МО РФ"
"Федеральное государственное образовательное учреждение высшего профессионального образования ""Военный инженерно-технический университет"" министерства обороны Российской Федерации"
"АНОО ВПО ""Институт экономики и управления в медицине и социальной сфере"""
"Государственное образовательное учреждение высшего профессионального образования ""Ярославский военный финансово-экономический институт им. ген. армии А.В.Хрулева"" министерства обороны РФ"
"Государственное образовательное учреждение высшего профессионального образования ""Уральский государственный университет им. А.М. Горького"""
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Кузбасская государственная педагогическая академия"""
"Чебоксарский политехнический институт (филиал) федерального государственного бюджетного образовательного учреждения высшего профессионального образования ""Московский государственный открытый университет имени В.С. Черномырдина"""
"Тобольский педагогический институт им. Д.И. Менделеева (филиал) федерального государственного автономного образовательного учреждения высшего образования ""Тюменский государственный университет"""
"Государственное бюджетное профессиональное образовательное учреждение города Москвы ""Московский государственный образовательный комплекс"""
"Государственное образовательное учреждение высшего профессионального образования ""Красноярский государственный технический университет"""
"Федеральное государственное бюджетное военное образовательное учреждение высшего образования ""Военно-технический университет"" министерства обороны российской федерации"
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Московский государственный индустриальный университет"""
"Частное образовательное учреждение высшего образования ""Институт бизнеса и права"""
"Международная академия ""Информация, связь, управление в технике, природе, обществе "" в форме некоммерческого партнерства"
"Федеральное государственное бюджетное образовательное учреждение высшего образования ""Вятский государственный гуманитарный университет"""
"Краевое государственное автономное профессиональное образовательное учреждение ""Дальневосточный государственный гуманитарно-технический колледж"""
"Медицинская академия имени С. И. Георгиевского"" Федерального государственного автономного образовательного учреждения высшего образования «Крымский федеральный университет имени В.И. Вернадского"
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Иркутский государственный лингвистический университет"""
"Федеральное государственное казенное военное образовательное учреждение высшего образования ""Московское высшее общевойсковое командное орденов Жукова, Ленина и октябрьской революции краснознаменное училище"" министерства обороны российской федерации"
"""Филиал федерального"
"Федеральное государственное бюджетное образовательное учреждение высшего профессионального образования ""Московский государственный университет природообустройства"""
"Государственное образовательное учреждение высшего профессионального образования ""Российский заочный институт текстильной и легкой промышленности"""
Федеральное государственное бюджетное образовательное учреждение высшего образования «Донецкий национальный университет экономики и торговли имени Михаила Туган-Барановского»
"Частное учреждение дополнительного профессионального образования ""Московский институт права"""
"Частное учреждение высшего образования ""Универсальный институт инновационных технологий"""'''.split(
            "\n"
        )
    ]
)
res2 = res.split(",")
inst = []
for item in res2:
    g = item.replace('""', '"').strip()
    if g[0] == '"':
        g = g[1:-1]
    inst.append(g)
print(",".join(inst))
######################################################################################
######################################################################################
######################################################################################
######################################################################################
######################################################################################
######################################################################################
######################################################################################
######################################################################################
######################################################################################
"""Высшее
Бакалавр
Магистр
Кандидат наук
Доктор наук
Незаконченное высшее
Среднее
Среднее специальное"""
